/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50553
Source Host           : localhost:3306
Source Database       : shenhua

Target Server Type    : MYSQL
Target Server Version : 50553
File Encoding         : 65001

Date: 2017-09-29 15:19:54
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for equipment
-- ----------------------------
DROP TABLE IF EXISTS `equipment`;
CREATE TABLE `equipment` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `equ_no` int(10) NOT NULL DEFAULT '0',
  `equ_name` varchar(50) NOT NULL DEFAULT '',
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of equipment
-- ----------------------------
INSERT INTO `equipment` VALUES ('1', '100', '一号破碎站', '1506501804', '1506501804');
INSERT INTO `equipment` VALUES ('2', '200', '二号破碎站', '1506501813', '1506501813');

-- ----------------------------
-- Table structure for info_warning
-- ----------------------------
DROP TABLE IF EXISTS `info_warning`;
CREATE TABLE `info_warning` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `equ_no` int(11) NOT NULL COMMENT '设备编号',
  `equ_oil_no` int(11) NOT NULL COMMENT '润滑点编号',
  `equ_key_no` int(10) DEFAULT NULL,
  `equ_name` varchar(100) DEFAULT NULL COMMENT '设备名称',
  `equ_oil_name` varchar(255) DEFAULT NULL COMMENT '润滑点名称',
  `del_warning_time` varchar(100) DEFAULT NULL,
  `warning_type` tinyint(1) DEFAULT NULL COMMENT '1:润滑 0:延期 ',
  `how_long` int(11) DEFAULT NULL COMMENT '距离上次润滑的运行时长',
  `postpone` int(10) DEFAULT NULL COMMENT '延期时长',
  `deadline` int(10) DEFAULT NULL COMMENT '润滑截止日期',
  `status` tinyint(1) DEFAULT NULL,
  `is_first_period` tinyint(1) DEFAULT NULL COMMENT '是否在首保周期',
  `postpone_reason` varchar(255) DEFAULT NULL COMMENT '延期原因',
  `user_id` int(10) DEFAULT NULL COMMENT '操作人员',
  `oil_no` int(11) DEFAULT NULL COMMENT '物料编号',
  `quantity` int(10) DEFAULT NULL COMMENT '用量',
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=137 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of info_warning
-- ----------------------------
INSERT INTO `info_warning` VALUES ('136', '200', '17', '200201717', '二号破碎站', '二号破碎站破碎机机集中润滑泵', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '11249919', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('135', '200', '16', '200201716', '二号破碎站', '二号破碎站破碎机同步齿轮箱', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '11249919', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('134', '200', '15', '200201715', '二号破碎站', '二号破碎站破碎机减速机', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '11249919', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('133', '200', '14', '200201714', '二号破碎站', '二号破碎站破碎机偶合器', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '11249919', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('131', '200', '12', '200201712', '二号破碎站', '二号破碎站板式给料机集中润滑泵', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '11249919', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('132', '200', '13', '200201713', '二号破碎站', '二号破碎站破碎机电机', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '11249919', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('130', '200', '11', '200201711', '二号破碎站', '二号破碎站板式给料机尾轮右侧轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '11249919', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('129', '200', '10', '200201710', '二号破碎站', '二号破碎站板式给料机尾轮左侧轴承', '1483372800', '1', '360', null, '-360', '3', '1', null, '1', '11249919', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('128', '200', '9', '20020179', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '11102440', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('127', '200', '8', '20020178', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '11102440', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('125', '200', '6', '20020176', '二号破碎站', '二号破碎站板式给料机右侧减速机', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '11102440', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('124', '200', '5', '20020175', '二号破碎站', '二号破碎站板式给料机左侧减速机', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '11102440', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('123', '200', '4', '20020174', '二号破碎站', '二号破碎站板式给料机右侧电动后端轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '11102440', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('122', '200', '3', '20020173', '二号破碎站', '二号破碎站板式给料机左侧电动机前端轴承', '1483372800', '0', '360', '300', '3440', '1', '0', '设备维修', '1', null, null, '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('119', '100', '17', '100201717', '一号破碎站', '一号破碎站破碎机机集中润滑泵', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '11102440', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('118', '100', '16', '100201716', '一号破碎站', '一号破碎站破碎机同步齿轮箱', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209288', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('117', '100', '15', '100201715', '一号破碎站', '一号破碎站破碎机减速机', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209288', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('115', '100', '13', '100201713', '一号破碎站', '一号破碎站破碎机电机', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209288', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('116', '100', '14', '100201714', '一号破碎站', '一号破碎站破碎机偶合器', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209288', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('114', '100', '12', '100201712', '一号破碎站', '一号破碎站板式给料机集中润滑泵', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209288', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('112', '100', '10', '100201710', '一号破碎站', '一号破碎站板式给料机尾轮左侧轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209288', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('113', '100', '11', '100201711', '一号破碎站', '一号破碎站板式给料机尾轮右侧轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209288', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('111', '100', '9', '10020179', '一号破碎站', '一号破碎站板式给料机头轮左侧轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209288', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('110', '100', '8', '10020178', '一号破碎站', '一号破碎站板式给料机头轮左侧轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209288', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('109', '100', '7', '10020177', '一号破碎站', '一号破碎站板式给料机低速联轴器', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209288', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('103', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机右侧电动机后端轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209358', '100', '1506563381', '1506563735');
INSERT INTO `info_warning` VALUES ('104', '100', '2', '10020172', '一号破碎站', '一号破碎站板式给料机右侧电动机后端轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209358', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('106', '100', '4', '10020174', '一号破碎站', '一号破碎站板式给料机右侧电动后端轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209358', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('107', '100', '5', '10020175', '一号破碎站', '一号破碎站板式给料机左侧减速机', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209358', '100', '1506563381', '1506563381');
INSERT INTO `info_warning` VALUES ('108', '100', '6', '10020176', '一号破碎站', '一号破碎站板式给料机右侧减速机', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209358', '100', '1506563381', '1506563381');

-- ----------------------------
-- Table structure for oil_analysis
-- ----------------------------
DROP TABLE IF EXISTS `oil_analysis`;
CREATE TABLE `oil_analysis` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `equ_no` int(11) NOT NULL DEFAULT '0' COMMENT '设备名称编号',
  `equ_oil_no` int(11) NOT NULL DEFAULT '0' COMMENT '润滑点编号',
  `equ_key_no` int(10) DEFAULT NULL,
  `equ_name` varchar(100) DEFAULT NULL,
  `equ_oil_name` varchar(255) DEFAULT NULL,
  `sampling_time` int(15) DEFAULT NULL COMMENT '采样日期',
  `work_hour` int(20) DEFAULT NULL,
  `oil_no` int(20) DEFAULT NULL,
  `Fe` float(10,2) DEFAULT NULL,
  `Cu` float(10,2) DEFAULT NULL,
  `Al` float(10,2) DEFAULT NULL,
  `Si` float(10,2) DEFAULT NULL,
  `Na` float(10,2) DEFAULT NULL,
  `pq` int(2) DEFAULT NULL COMMENT 'PQ',
  `viscosity` float(10,2) DEFAULT NULL COMMENT '粘度',
  `oil_status` varchar(50) DEFAULT '正常' COMMENT '油脂状态',
  `advise` int(1) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=115 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oil_analysis
-- ----------------------------
INSERT INTO `oil_analysis` VALUES ('69', '100', '1', '10020171', null, '一号破碎站板式给料机左侧电动机前端轴承', '1483286400', '360', '10209358', '1.26', '4.44', '1.60', '3.69', '2.19', '0', '15.20', '', '1', '1506566040', '1506566040');
INSERT INTO `oil_analysis` VALUES ('70', '100', '2', '10020172', null, '一号破碎站板式给料机右侧电动机后端轴承', '1483372800', '360', '10209358', '1.72', '11.30', '1.09', '2.40', '2.05', '5', '15.90', 'Cu元素超标', '0', '1506566040', '1506667832');
INSERT INTO `oil_analysis` VALUES ('71', '100', '3', '10020173', null, '一号破碎站板式给料机左侧电动机前端轴承', '1483459200', '360', null, '2.20', '0.50', '0.02', '2.10', '1.71', '1', '16.00', '', '1', '1506566040', '1506667832');
INSERT INTO `oil_analysis` VALUES ('72', '100', '4', '10020174', null, '一号破碎站板式给料机右侧电动后端轴承', '1483545600', '360', '10209358', '1.20', '3.69', '1.16', '2.88', '1.88', '15', '15.90', 'PQ值超标', '0', '1506566040', '1506667832');
INSERT INTO `oil_analysis` VALUES ('73', '100', '5', '10020175', null, '一号破碎站板式给料机左侧减速机', '1483632000', '360', '10209358', '1.31', '3.78', '0.39', '3.08', '2.46', '5', '16.00', '', '1', '1506566040', '1506667832');
INSERT INTO `oil_analysis` VALUES ('74', '100', '6', '10020176', null, '一号破碎站板式给料机右侧减速机', '1483718400', '360', '10209358', '1.91', '1.13', '0.00', '1.88', '3.07', '10', '15.30', 'PQ值超标', '0', '1506566040', '1506667832');
INSERT INTO `oil_analysis` VALUES ('75', '100', '7', '10020177', null, '一号破碎站板式给料机低速联轴器', '1483804800', '360', '10209288', '1.56', '0.39', '0.58', '5.80', '0.73', '5', '15.50', '', '1', '1506566040', '1506667832');
INSERT INTO `oil_analysis` VALUES ('76', '100', '8', '10020178', null, '一号破碎站板式给料机头轮左侧轴承', '1483891200', '360', '10209288', '0.69', '2.15', '0.00', '2.45', '1.70', '0', '15.20', '', '1', '1506566040', '1506667832');
INSERT INTO `oil_analysis` VALUES ('77', '100', '9', '10020179', null, '一号破碎站板式给料机头轮左侧轴承', '1483977600', '360', '10209288', '1.16', '0.99', '0.39', '2.80', '1.73', '0', '15.20', '', '1', '1506566040', '1506667832');
INSERT INTO `oil_analysis` VALUES ('78', '100', '10', '100201710', null, '一号破碎站板式给料机尾轮左侧轴承', '1484064000', '360', '10209288', '1.37', '0.22', '0.00', '1.22', '2.18', '0', '16.10', '粘度偏高', '0', '1506566040', '1506667832');
INSERT INTO `oil_analysis` VALUES ('79', '100', '11', '100201711', null, '一号破碎站板式给料机尾轮右侧轴承', '1484150400', '360', '10209288', '0.94', '0.93', '0.50', '5.80', '2.52', '5', '31.20', '粘度偏高', '0', '1506566040', '1506566040');
INSERT INTO `oil_analysis` VALUES ('80', '100', '12', '100201712', null, '一号破碎站板式给料机集中润滑泵', '1484236800', '360', '10209288', '4.29', '0.59', '0.00', '11.36', '2.72', '0', '16.70', 'Si元素超标<br>粘度偏高', '0', '1506566040', '1506667832');
INSERT INTO `oil_analysis` VALUES ('81', '100', '13', '100201713', null, '一号破碎站破碎机电机', '1484323200', '360', '10209288', '2.28', '1.48', '0.23', '3.04', '3.33', '0', '17.30', '粘度偏高', '0', '1506566040', '1506667832');
INSERT INTO `oil_analysis` VALUES ('82', '100', '14', '100201714', null, '一号破碎站破碎机偶合器', '1484409600', '360', '10209288', '0.37', '4.18', '0.00', '0.61', '1.71', '0', '15.10', '', '1', '1506566040', '1506667832');
INSERT INTO `oil_analysis` VALUES ('83', '100', '15', '100201715', null, '一号破碎站破碎机减速机', '1484496000', '360', '10209288', '3.63', '0.82', '0.00', '0.65', '18.41', '0', '15.00', 'Na元素超标', '0', '1506566041', '1506667832');
INSERT INTO `oil_analysis` VALUES ('84', '100', '16', '100201716', null, '一号破碎站破碎机同步齿轮箱', '1484582400', '360', '10209288', '0.44', '1.18', '0.28', '0.29', '0.36', '5', '45.50', '粘度偏高', '0', '1506566041', '1506566041');
INSERT INTO `oil_analysis` VALUES ('85', '100', '17', '100201717', null, '一号破碎站破碎机机集中润滑泵', '1484668800', '360', '11102440', '5.27', '2.36', '10.18', '18.28', '1.89', '5', '47.20', 'Al元素超标<br>Si元素超标<br>粘度偏高', '0', '1506566041', '1506566041');
INSERT INTO `oil_analysis` VALUES ('88', '200', '3', '20020173', null, '二号破碎站板式给料机左侧电动机前端轴承', '1484928000', '360', null, '3.16', '0.71', '0.00', '1.80', '7.47', '0', '15.50', 'Na元素超标', '0', '1506566041', '1506667832');
INSERT INTO `oil_analysis` VALUES ('89', '200', '4', '20020174', null, '二号破碎站板式给料机右侧电动后端轴承', '1485014400', '360', '11102440', '0.50', '2.83', '0.00', '2.73', '1.16', '0', '16.20', '粘度偏高', '0', '1506566041', '1506667832');
INSERT INTO `oil_analysis` VALUES ('90', '200', '5', '20020175', null, '二号破碎站板式给料机左侧减速机', '1485100800', '360', '11102440', '5.58', '1.31', '0.36', '4.52', '120.18', '0', '16.40', 'Na元素超标<br>粘度偏高', '0', '1506566041', '1506665692');
INSERT INTO `oil_analysis` VALUES ('91', '200', '6', '20020176', null, '二号破碎站板式给料机右侧减速机', '1485187200', '360', '11102440', '0.90', '4.20', '0.00', '3.71', '1.82', '0', '30.20', '粘度偏高', '0', '1506566041', '1506566041');
INSERT INTO `oil_analysis` VALUES ('93', '200', '8', '20020178', null, '二号破碎站板式给料机头轮左侧轴承', '1485360000', '360', '11102440', '7.01', '1.33', '0.45', '1.09', '6.12', '0', '16.50', 'Fe元素超标<br>Na元素超标<br>粘度偏高', '0', '1506566041', '1506666949');
INSERT INTO `oil_analysis` VALUES ('94', '200', '9', '20020179', null, '二号破碎站板式给料机头轮左侧轴承', '1485446400', '360', '11102440', '0.40', '0.42', '0.00', '2.27', '1.91', '0', '16.50', '粘度偏高', '0', '1506566041', '1506667832');
INSERT INTO `oil_analysis` VALUES ('95', '200', '10', '200201710', null, '二号破碎站板式给料机尾轮左侧轴承', '1485532800', '360', '11249919', '6.10', '0.83', '0.02', '5.05', '3.31', '0', '17.70', '粘度偏高', '0', '1506566041', '1506667832');
INSERT INTO `oil_analysis` VALUES ('96', '200', '11', '200201711', null, '二号破碎站板式给料机尾轮右侧轴承', '1485619200', '360', '11249919', '1.24', '1.07', '1.03', '15.00', '1.14', '0', '47.10', 'Si元素超标<br>粘度偏高', '0', '1506566041', '1506666991');
INSERT INTO `oil_analysis` VALUES ('97', '200', '12', '200201712', null, '二号破碎站板式给料机集中润滑泵', '1485705600', '360', '11249919', '0.42', '1.02', '0.00', '20.28', '2.18', '0', '11.00', 'Si元素超标<br>粘度偏低', '0', '1506566041', '1506566041');
INSERT INTO `oil_analysis` VALUES ('98', '200', '13', '200201713', null, '二号破碎站破碎机电机', '1485792000', '360', '11249919', '2.12', '0.55', '0.00', '2.54', '2.58', '0', '14.40', '', '1', '1506566041', '1506566041');
INSERT INTO `oil_analysis` VALUES ('99', '200', '14', '200201714', null, '二号破碎站破碎机偶合器', '1485878400', '360', '11249919', '4.87', '6.92', '0.59', '3.09', '0.22', '0', '404.60', '粘度偏高', '0', '1506566041', '1506566041');
INSERT INTO `oil_analysis` VALUES ('100', '200', '15', '200201715', null, '二号破碎站破碎机减速机', '1485964800', '0', '11249919', '4.75', '3.90', '110.91', '7.53', '3.30', '0', '11.50', 'Al元素超标<br>粘度偏低', '0', '1506566041', '1506566041');
INSERT INTO `oil_analysis` VALUES ('101', '200', '16', '200201716', null, '二号破碎站破碎机同步齿轮箱', '1486051200', '0', '11249919', '0.50', '2.83', '0.00', '2.73', '1.16', '0', '16.20', '粘度偏高', '0', '1506566041', '1506667833');
INSERT INTO `oil_analysis` VALUES ('102', '200', '17', '200201717', null, '二号破碎站破碎机机集中润滑泵', '1486137600', '0', '11249919', '5.58', '1.31', '0.36', '4.52', '120.18', '0', '16.40', 'Na元素超标<br>粘度偏高', '0', '1506566041', '1506665692');
INSERT INTO `oil_analysis` VALUES ('103', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '1506614400', '0', '10209358', '1.60', '8.60', '2.80', '3.10', '2.12', '2', '12.00', 'Cu元素超标', '0', '1506649783', '1506649783');
INSERT INTO `oil_analysis` VALUES ('104', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '1506700800', '0', '10209358', '2.10', '3.60', '1.30', '2.10', '3.65', '2', '12.00', '', '1', '1506656153', '1506656153');
INSERT INTO `oil_analysis` VALUES ('105', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '1507478400', '0', '10209358', '6.00', '8.00', '10.00', '1.69', '20.00', '2', '12.00', 'Cu元素超标<br>Al元素超标', '0', '1506656298', '1506656298');
INSERT INTO `oil_analysis` VALUES ('106', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '1507564800', '0', '10209358', '5.10', '3.60', '1.30', '4.10', '3.65', '2', '12.00', '', '1', '1506666313', '1506666313');
INSERT INTO `oil_analysis` VALUES ('107', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '1507651200', '0', '10209358', '3.10', '4.60', '2.30', '3.10', '4.65', '4', '14.00', '', '1', '1506666385', '1506666385');
INSERT INTO `oil_analysis` VALUES ('108', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '1507737600', '0', '10209358', '5.10', '6.60', '4.30', '2.10', '5.65', '7', '14.00', '', '1', '1506666440', '1506666440');
INSERT INTO `oil_analysis` VALUES ('109', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '1507824000', '0', '10209358', '5.10', '6.60', '4.30', '8.10', '13.65', '12', '17.00', '粘度偏高', '0', '1506666508', '1506666508');
INSERT INTO `oil_analysis` VALUES ('110', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '1507910400', '0', '10209358', '2.10', '3.60', '1.30', '2.10', '3.65', '2', '10.00', '粘度偏低', '0', '1506666610', '1506666610');
INSERT INTO `oil_analysis` VALUES ('111', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '1507996800', '0', '10209358', '3.10', '4.60', '1.30', '4.10', '2.65', '5', '13.00', '', '1', '1506668155', '1506668155');
INSERT INTO `oil_analysis` VALUES ('112', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '1508083200', '0', '10209358', '3.10', '2.60', '4.30', '6.10', '1.65', '9', '17.00', 'PQ值超标<br>粘度偏高', '0', '1506668188', '1506668188');
INSERT INTO `oil_analysis` VALUES ('113', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '1508169600', '0', '10209358', '2.10', '3.60', '1.30', '2.10', '3.65', '2', '12.00', '', '1', '1506668220', '1506668220');

-- ----------------------------
-- Table structure for oil_config
-- ----------------------------
DROP TABLE IF EXISTS `oil_config`;
CREATE TABLE `oil_config` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `postpone` int(10) DEFAULT '0',
  `Fe` float(10,2) DEFAULT '0.00',
  `Cu` float(10,2) DEFAULT '0.00',
  `Al` float(10,2) DEFAULT '0.00',
  `Si` float(10,2) DEFAULT '0.00',
  `Na` float(10,2) DEFAULT '0.00',
  `pq` int(2) DEFAULT '0' COMMENT 'PQ',
  `viscosity_max` int(10) DEFAULT '0',
  `viscosity_min` int(10) DEFAULT '0',
  `update_time` int(11) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oil_config
-- ----------------------------
INSERT INTO `oil_config` VALUES ('1', '360', '6.21', '7.36', '6.11', '7.90', '5.26', '9', '16', '12', '1506667832', null);

-- ----------------------------
-- Table structure for oil_detail
-- ----------------------------
DROP TABLE IF EXISTS `oil_detail`;
CREATE TABLE `oil_detail` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `oil_no` int(11) DEFAULT NULL COMMENT '物料编码',
  `oil_name` varchar(150) DEFAULT NULL COMMENT '润滑油名称',
  `detail` varchar(255) DEFAULT NULL COMMENT '物料描述',
  `unit` varchar(10) DEFAULT NULL COMMENT '单位',
  `price` float(10,2) DEFAULT NULL COMMENT '价格',
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `oil_detail_id_uindex` (`id`),
  UNIQUE KEY `oil_detail_oil_no_uindex` (`oil_no`)
) ENGINE=MyISAM AUTO_INCREMENT=21 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oil_detail
-- ----------------------------
INSERT INTO `oil_detail` VALUES ('1', '10209358', '抗磨液压油', 'DTE 25;VG46;1×208L\\美孚', 'L', '20.56', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('2', '10209348', '抗磨液压油', 'DTE 10 超凡 15;VG15;1×208L\\美孚', 'L', '21.34', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('3', '10209351', '抗磨液压油', 'DTE 10 超凡 32;VG32;1×208L\\美孚', 'L', '21.70', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('4', '10209286', '超级齿轮油', '600 XP 220;VG220;1×208L\\美孚', 'L', '17.01', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('5', '10209288', '超级齿轮油', '600 XP 320;VG320;1×208L\\美孚', 'L', '18.61', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('6', '10209289', '超级齿轮油', '600 XP 460;VG460;1×208L\\美孚', 'L', '18.77', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('7', '11102440', '液力传动油', '6#;1×170kg;200L\\昆仑', 'KG', '12.60', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('8', '10209398', '传动油', '424;1×208L\\美孚', 'L', '24.30', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('9', '10209313', '合成齿轮油', 'SHC 626;VG68;1×208L\\美孚', 'L', '98.03', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('10', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '98.89', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('11', '11249919', '极压锂基润滑脂', '尚博 0#;1×17kg\\长城', 'KG', '14.03', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('12', '10061964', '极压锂基润滑脂', '尚博 3#;1×17kg\\长城', 'KG', '13.98', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('13', '11249923', '通用锂基脂', '尚博 0#;1×17kg\\长城', 'KG', '12.95', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('14', '11249924', '通用锂基脂', '尚博 1#;1×17kg\\长城', 'KG', '12.95', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('15', '10889994', '通用锂基脂', '尚博 2#;1×17kg\\长城', 'KG', '12.95', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('16', '10889996', '通用锂基脂', '尚博 3#;1×17kg\\长城', 'KG', '13.64', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('17', '11249907', '二硫化钼锂基润滑脂', '尚博 0#;1×17KG\\长城', 'KG', '15.25', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('18', '10705085', '二硫化钼锂基润滑脂', '尚博 2#;1×17KG\\长城', 'KG', '15.11', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('19', '11249914', '高温高速润滑脂', 'HTHS 2#;1×17kg\\长城', 'KG', '34.53', '1506502016', '1506502016');
INSERT INTO `oil_detail` VALUES ('20', '10209438', '复合锂基润滑脂', '力富 SHC 100;NLGI 2;1×16kg\\美孚', 'KG', '121.50', '1506502016', '1506502016');

-- ----------------------------
-- Table structure for oil_standard
-- ----------------------------
DROP TABLE IF EXISTS `oil_standard`;
CREATE TABLE `oil_standard` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `equ_no` int(11) NOT NULL DEFAULT '0' COMMENT '设备编号',
  `equ_oil_no` int(11) NOT NULL DEFAULT '0' COMMENT '润滑点编号',
  `equ_key_no` int(10) DEFAULT NULL,
  `equ_name` varchar(255) DEFAULT '' COMMENT '设备名称',
  `equ_oil_name` varchar(100) NOT NULL DEFAULT '' COMMENT '润滑点全称',
  `oil_no` int(10) NOT NULL DEFAULT '0' COMMENT '物料编码',
  `quantity` int(10) NOT NULL DEFAULT '0' COMMENT '用量',
  `unit` varchar(10) NOT NULL DEFAULT '' COMMENT '单位\n',
  `first_period` int(10) NOT NULL DEFAULT '0' COMMENT '首保周期',
  `period` int(10) NOT NULL DEFAULT '0' COMMENT '更换最长周期',
  `interval` int(10) NOT NULL DEFAULT '0' COMMENT '油脂采样间隔',
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `oil_standard_id_uindex` (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=35 DEFAULT CHARSET=utf8 COMMENT='润滑标准样表';

-- ----------------------------
-- Records of oil_standard
-- ----------------------------
INSERT INTO `oil_standard` VALUES ('1', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '10209358', '100', 'KG', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('2', '100', '2', '10020172', '一号破碎站', '一号破碎站板式给料机右侧电动机后端轴承', '10209348', '100', 'KG', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('3', '100', '3', '10020173', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '10209351', '100', 'KG', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('4', '100', '4', '10020174', '一号破碎站', '一号破碎站板式给料机右侧电动后端轴承', '10209286', '100', 'KG', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('5', '100', '5', '10020175', '一号破碎站', '一号破碎站板式给料机左侧减速机', '10209288', '100', 'L', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('6', '100', '6', '10020176', '一号破碎站', '一号破碎站板式给料机右侧减速机', '10209289', '100', 'L', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('7', '100', '7', '10020177', '一号破碎站', '一号破碎站板式给料机低速联轴器', '11102440', '100', 'KG', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('8', '100', '8', '10020178', '一号破碎站', '一号破碎站板式给料机头轮左侧轴承', '10209398', '100', 'KG', '0', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('9', '100', '9', '10020179', '一号破碎站', '一号破碎站板式给料机头轮左侧轴承', '10209313', '100', 'KG', '0', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('10', '100', '10', '100201710', '一号破碎站', '一号破碎站板式给料机尾轮左侧轴承', '10209315', '100', 'KG', '0', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('11', '100', '11', '100201711', '一号破碎站', '一号破碎站板式给料机尾轮右侧轴承', '11249919', '100', 'KG', '0', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('12', '100', '12', '100201712', '一号破碎站', '一号破碎站板式给料机集中润滑泵', '10061964', '100', 'KG', '0', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('13', '100', '13', '100201713', '一号破碎站', '一号破碎站破碎机电机', '11249923', '100', 'KG', '0', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('14', '100', '14', '100201714', '一号破碎站', '一号破碎站破碎机偶合器', '11249924', '100', 'L', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('15', '100', '15', '100201715', '一号破碎站', '一号破碎站破碎机减速机', '10889994', '100', 'L', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('16', '100', '16', '100201716', '一号破碎站', '一号破碎站破碎机同步齿轮箱', '10889996', '100', 'L', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('17', '100', '17', '100201717', '一号破碎站', '一号破碎站破碎机机集中润滑泵', '11249907', '100', 'KG', '0', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('18', '200', '1', '20020171', '二号破碎站', '二号破碎站板式给料机左侧电动机前端轴承', '10209351', '100', 'KG', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('19', '200', '2', '20020172', '二号破碎站', '二号破碎站板式给料机右侧电动机后端轴承', '10209286', '100', 'KG', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('20', '200', '3', '20020173', '二号破碎站', '二号破碎站板式给料机左侧电动机前端轴承', '10209288', '100', 'KG', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('21', '200', '4', '20020174', '二号破碎站', '二号破碎站板式给料机右侧电动后端轴承', '10209289', '100', 'KG', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('22', '200', '5', '20020175', '二号破碎站', '二号破碎站板式给料机左侧减速机', '11102440', '100', 'L', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('23', '200', '6', '20020176', '二号破碎站', '二号破碎站板式给料机右侧减速机', '10209398', '100', 'L', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('24', '200', '7', '20020177', '二号破碎站', '二号破碎站板式给料机低速联轴器', '10209313', '100', 'KG', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('25', '200', '8', '20020178', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '10209315', '100', 'KG', '0', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('26', '200', '9', '20020179', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '11249919', '100', 'KG', '0', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('27', '200', '10', '200201710', '二号破碎站', '二号破碎站板式给料机尾轮左侧轴承', '10061964', '100', 'KG', '0', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('28', '200', '11', '200201711', '二号破碎站', '二号破碎站板式给料机尾轮右侧轴承', '11249923', '100', 'KG', '0', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('29', '200', '12', '200201712', '二号破碎站', '二号破碎站板式给料机集中润滑泵', '11249924', '100', 'KG', '0', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('30', '200', '13', '200201713', '二号破碎站', '二号破碎站破碎机电机', '10889994', '100', 'KG', '0', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('31', '200', '14', '200201714', '二号破碎站', '二号破碎站破碎机偶合器', '10889996', '100', 'L', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('32', '200', '15', '200201715', '二号破碎站', '二号破碎站破碎机减速机', '11249907', '100', 'L', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('33', '200', '16', '200201716', '二号破碎站', '二号破碎站破碎机同步齿轮箱', '10705085', '100', 'L', '500', '3500', '500', '1506501819', '1506501819');
INSERT INTO `oil_standard` VALUES ('34', '200', '17', '200201717', '二号破碎站', '二号破碎站破碎机机集中润滑泵', '11249914', '100', 'KG', '0', '3500', '500', '1506501819', '1506501819');

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `account` varchar(30) NOT NULL,
  `password` char(32) NOT NULL,
  `scope` tinyint(2) DEFAULT NULL COMMENT '权限 1：超级管理员 2：系统维护员 3：普通工作人员',
  `name` varchar(10) DEFAULT NULL,
  `phone` char(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `user_account_uindex` (`account`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('1', 'admin', 'e10adc3949ba59abbe56e057f20f883e', '36', 'admin', '15148936547', null, null);
INSERT INTO `user` VALUES ('4', 'runhua1', 'e10adc3949ba59abbe56e057f20f883e', '18', '王宝强', '', '1506419665', '1506419665');
INSERT INTO `user` VALUES ('5', 'runhua2', 'e10adc3949ba59abbe56e057f20f883e', '9', '宋伟', '', '1506419689', '1506419689');

-- ----------------------------
-- Table structure for work_hour
-- ----------------------------
DROP TABLE IF EXISTS `work_hour`;
CREATE TABLE `work_hour` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `equ_no` int(11) NOT NULL COMMENT '设备编号',
  `equ_oil_no` int(11) NOT NULL COMMENT '润滑点编号',
  `equ_key_no` int(10) DEFAULT NULL,
  `equ_oil_name` varchar(100) DEFAULT NULL COMMENT '润滑点名称',
  `working_hour` int(100) NOT NULL,
  `start_time` int(100) DEFAULT NULL,
  `create_time` int(100) DEFAULT NULL,
  `update_time` int(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=103 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of work_hour
-- ----------------------------
INSERT INTO `work_hour` VALUES ('1', '100', '1', '10020171', '一号破碎站板式给料机右侧电动机后端轴承', '360', '1483200000', '1506501871', '1506563370');
INSERT INTO `work_hour` VALUES ('2', '100', '2', '10020172', '一号破碎站板式给料机右侧电动机后端轴承', '360', '1483200000', '1506501871', '1506563370');
INSERT INTO `work_hour` VALUES ('3', '100', '3', '10020173', '一号破碎站板式给料机左侧电动机前端轴承', '360', '1483200000', '1506501871', '1506563370');
INSERT INTO `work_hour` VALUES ('4', '100', '4', '10020174', '一号破碎站板式给料机右侧电动后端轴承', '360', '1483200000', '1506501871', '1506563370');
INSERT INTO `work_hour` VALUES ('5', '100', '5', '10020175', '一号破碎站板式给料机左侧减速机', '360', '1483200000', '1506501871', '1506563370');
INSERT INTO `work_hour` VALUES ('6', '100', '6', '10020176', '一号破碎站板式给料机右侧减速机', '360', '1483200000', '1506501871', '1506563370');
INSERT INTO `work_hour` VALUES ('7', '100', '7', '10020177', '一号破碎站板式给料机低速联轴器', '360', '1483200000', '1506501871', '1506563370');
INSERT INTO `work_hour` VALUES ('8', '100', '8', '10020178', '一号破碎站板式给料机头轮左侧轴承', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('9', '100', '9', '10020179', '一号破碎站板式给料机头轮左侧轴承', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('10', '100', '10', '100201710', '一号破碎站板式给料机尾轮左侧轴承', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('11', '100', '11', '100201711', '一号破碎站板式给料机尾轮右侧轴承', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('12', '100', '12', '100201712', '一号破碎站板式给料机集中润滑泵', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('13', '100', '13', '100201713', '一号破碎站破碎机电机', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('14', '100', '14', '100201714', '一号破碎站破碎机偶合器', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('15', '100', '15', '100201715', '一号破碎站破碎机减速机', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('16', '100', '16', '100201716', '一号破碎站破碎机同步齿轮箱', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('17', '100', '17', '100201717', '一号破碎站破碎机机集中润滑泵', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('20', '200', '3', '20020173', '二号破碎站板式给料机左侧电动机前端轴承', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('21', '200', '4', '20020174', '二号破碎站板式给料机右侧电动后端轴承', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('22', '200', '5', '20020175', '二号破碎站板式给料机左侧减速机', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('23', '200', '6', '20020176', '二号破碎站板式给料机右侧减速机', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('25', '200', '8', '20020178', '二号破碎站板式给料机头轮左侧轴承', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('26', '200', '9', '20020179', '二号破碎站板式给料机头轮左侧轴承', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('27', '200', '10', '200201710', '二号破碎站板式给料机尾轮左侧轴承', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('28', '200', '11', '200201711', '二号破碎站板式给料机尾轮右侧轴承', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('29', '200', '12', '200201712', '二号破碎站板式给料机集中润滑泵', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('30', '200', '13', '200201713', '二号破碎站破碎机电机', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('31', '200', '14', '200201714', '二号破碎站破碎机偶合器', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('32', '200', '15', '200201715', '二号破碎站破碎机减速机', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('33', '200', '16', '200201716', '二号破碎站破碎机同步齿轮箱', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('34', '200', '17', '200201717', '二号破碎站破碎机机集中润滑泵', '360', '1483200000', '1506501871', '1506563371');
INSERT INTO `work_hour` VALUES ('95', '200', '10', '200201710', '二号破碎站板式给料机尾轮左侧轴承', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('94', '200', '9', '20020179', '二号破碎站板式给料机头轮左侧轴承', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('93', '200', '8', '20020178', '二号破碎站板式给料机头轮左侧轴承', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('91', '200', '6', '20020176', '二号破碎站板式给料机右侧减速机', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('90', '200', '5', '20020175', '二号破碎站板式给料机左侧减速机', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('89', '200', '4', '20020174', '二号破碎站板式给料机右侧电动后端轴承', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('88', '200', '3', '20020173', '二号破碎站板式给料机左侧电动机前端轴承', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('85', '100', '17', '100201717', '一号破碎站破碎机机集中润滑泵', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('84', '100', '16', '100201716', '一号破碎站破碎机同步齿轮箱', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('83', '100', '15', '100201715', '一号破碎站破碎机减速机', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('82', '100', '14', '100201714', '一号破碎站破碎机偶合器', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('81', '100', '13', '100201713', '一号破碎站破碎机电机', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('80', '100', '12', '100201712', '一号破碎站板式给料机集中润滑泵', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('79', '100', '11', '100201711', '一号破碎站板式给料机尾轮右侧轴承', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('78', '100', '10', '100201710', '一号破碎站板式给料机尾轮左侧轴承', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('77', '100', '9', '10020179', '一号破碎站板式给料机头轮左侧轴承', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('76', '100', '8', '10020178', '一号破碎站板式给料机头轮左侧轴承', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('75', '100', '7', '10020177', '一号破碎站板式给料机低速联轴器', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('74', '100', '6', '10020176', '一号破碎站板式给料机右侧减速机', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('73', '100', '5', '10020175', '一号破碎站板式给料机左侧减速机', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('72', '100', '4', '10020174', '一号破碎站板式给料机右侧电动后端轴承', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('71', '100', '3', '10020173', '一号破碎站板式给料机左侧电动机前端轴承', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('70', '100', '2', '10020172', '一号破碎站板式给料机右侧电动机后端轴承', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('69', '100', '1', '10020171', '一号破碎站板式给料机右侧电动机后端轴承', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('96', '200', '11', '200201711', '二号破碎站板式给料机尾轮右侧轴承', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('97', '200', '12', '200201712', '二号破碎站板式给料机集中润滑泵', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('98', '200', '13', '200201713', '二号破碎站破碎机电机', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('99', '200', '14', '200201714', '二号破碎站破碎机偶合器', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('100', '200', '15', '200201715', '二号破碎站破碎机减速机', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('101', '200', '16', '200201716', '二号破碎站破碎机同步齿轮箱', '360', '1485878400', '1506563371', '1506563371');
INSERT INTO `work_hour` VALUES ('102', '200', '17', '200201717', '二号破碎站破碎机机集中润滑泵', '360', '1485878400', '1506563371', '1506563371');
