/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50553
Source Host           : localhost:3306
Source Database       : shenhua

Target Server Type    : MYSQL
Target Server Version : 50553
File Encoding         : 65001

Date: 2017-10-21 15:15:40
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for equipment
-- ----------------------------
DROP TABLE IF EXISTS `equipment`;
CREATE TABLE `equipment` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `equ_no` int(10) NOT NULL DEFAULT '0',
  `equ_name` varchar(50) NOT NULL DEFAULT '',
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of equipment
-- ----------------------------
INSERT INTO `equipment` VALUES ('1', '100', '一号破碎站', '1508569171', '1508569171');
INSERT INTO `equipment` VALUES ('2', '200', '二号破碎站', '1508569182', '1508569182');

-- ----------------------------
-- Table structure for info_warning
-- ----------------------------
DROP TABLE IF EXISTS `info_warning`;
CREATE TABLE `info_warning` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `equ_no` int(11) NOT NULL COMMENT '设备编号',
  `equ_oil_no` int(11) NOT NULL COMMENT '润滑点编号',
  `equ_key_no` int(10) DEFAULT NULL,
  `equ_name` varchar(100) DEFAULT NULL COMMENT '设备名称',
  `equ_oil_name` varchar(255) DEFAULT NULL COMMENT '润滑点名称',
  `del_warning_time` varchar(100) DEFAULT NULL,
  `warning_type` tinyint(1) DEFAULT NULL COMMENT '1:润滑 0:延期 ',
  `how_long` int(11) DEFAULT NULL COMMENT '距离上次润滑的运行时长',
  `postpone` int(10) DEFAULT NULL COMMENT '延期时长',
  `deadline` int(10) DEFAULT NULL COMMENT '润滑截止日期',
  `status` tinyint(1) DEFAULT NULL,
  `is_first_period` tinyint(1) DEFAULT NULL COMMENT '是否在首保周期',
  `postpone_reason` varchar(255) DEFAULT NULL COMMENT '延期原因',
  `user_id` int(10) DEFAULT NULL COMMENT '操作人员',
  `oil_no` int(11) DEFAULT NULL COMMENT '物料编号',
  `quantity` varchar(10) DEFAULT NULL COMMENT '用量',
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=36 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of info_warning
-- ----------------------------
INSERT INTO `info_warning` VALUES ('1', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机右侧电动机后端轴承', '1485705600', '1', '6351', null, '-2851', '3', '0', null, '1', '11249923', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('2', '100', '2', '10020172', '一号破碎站', '一号破碎站板式给料机右侧电动机后端轴承', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209348', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('3', '100', '3', '10020173', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '1485705600', '0', '0', '500', '1000', '1', '1', '维修', '1', null, null, '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('4', '100', '4', '10020174', '一号破碎站', '一号破碎站板式给料机右侧电动后端轴承', '1485705600', '1', '6351', null, '-2851', '3', '0', null, '1', '11249919', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('5', '100', '5', '10020175', '一号破碎站', '一号破碎站板式给料机左侧减速机', '1485705600', '1', '6351', null, '-2851', '3', '0', null, '1', '11249919', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('6', '100', '6', '10020176', '一号破碎站', '一号破碎站板式给料机右侧减速机', '1485705600', '1', '6351', null, '-2851', '3', '0', null, '1', '11249907', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('7', '100', '7', '10020177', '一号破碎站', '一号破碎站板式给料机低速联轴器', '1485705600', '1', '6351', null, '-2851', '3', '0', null, '1', '10061964', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('8', '100', '8', '10020178', '一号破碎站', '一号破碎站板式给料机头轮左侧轴承', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209315', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('9', '100', '9', '10020179', '一号破碎站', '一号破碎站板式给料机头轮左侧轴承', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209313', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('10', '100', '10', '100201710', '一号破碎站', '一号破碎站板式给料机尾轮左侧轴承', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209315', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('11', '100', '11', '100201711', '一号破碎站', '一号破碎站板式给料机尾轮右侧轴承', '1485705600', '1', '6351', null, '-2851', '3', '0', null, '1', '11249919', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('12', '100', '12', '100201712', '一号破碎站', '一号破碎站板式给料机集中润滑泵', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209315', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('13', '100', '13', '100201713', '一号破碎站', '一号破碎站破碎机电机', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209315', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('14', '100', '14', '100201714', '一号破碎站', '一号破碎站破碎机偶合器', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209288', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('15', '100', '15', '100201715', '一号破碎站', '一号破碎站破碎机减速机', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209315', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('16', '100', '16', '100201716', '一号破碎站', '一号破碎站破碎机同步齿轮箱', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209315', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('17', '100', '17', '100201717', '一号破碎站', '一号破碎站破碎机机集中润滑泵', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209288', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('18', '200', '1', '20020171', '二号破碎站', '二号破碎站板式给料机右侧电动机后端轴承', '1485705600', '1', '6351', null, '-2851', '3', '0', null, '1', '11249923', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('19', '200', '2', '20020172', '二号破碎站', '二号破碎站板式给料机右侧电动机后端轴承', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209348', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('20', '200', '3', '20020173', '二号破碎站', '二号破碎站板式给料机左侧电动机前端轴承', '1485705600', '1', '6351', null, '-2851', '3', '0', null, '1', '10889994', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('21', '200', '4', '20020174', '二号破碎站', '二号破碎站板式给料机右侧电动后端轴承', '1485705600', '1', '6351', null, '-2851', '3', '0', null, '1', '11249919', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('22', '200', '5', '20020175', '二号破碎站', '二号破碎站板式给料机左侧减速机', '1485705600', '1', '6351', null, '-2851', '3', '0', null, '1', '11249919', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('23', '200', '6', '20020176', '二号破碎站', '二号破碎站板式给料机右侧减速机', '1485705600', '1', '6351', null, '-2851', '3', '0', null, '1', '11249907', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('24', '200', '7', '20020177', '二号破碎站', '二号破碎站板式给料机低速联轴器', '1485705600', '1', '6351', null, '-2851', '3', '0', null, '1', '10061964', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('25', '200', '8', '20020178', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209315', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('26', '200', '9', '20020179', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209313', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('27', '200', '10', '200201710', '二号破碎站', '二号破碎站板式给料机尾轮左侧轴承', '1485705600', '1', '800', null, '-800', '3', '1', null, '1', '10209315', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('28', '200', '11', '200201711', '二号破碎站', '二号破碎站板式给料机尾轮右侧轴承', '1485705600', '1', '6351', null, '-2851', '3', '0', null, '1', '11249919', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('29', '200', '12', '200201712', '二号破碎站', '二号破碎站板式给料机集中润滑泵', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209315', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('30', '200', '13', '200201713', '二号破碎站', '二号破碎站破碎机电机', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209315', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('31', '200', '14', '200201714', '二号破碎站', '二号破碎站破碎机偶合器', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209288', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('32', '200', '15', '200201715', '二号破碎站', '二号破碎站破碎机减速机', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209315', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('33', '200', '16', '200201716', '二号破碎站', '二号破碎站破碎机同步齿轮箱', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209315', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('34', '200', '17', '200201717', '二号破碎站', '二号破碎站破碎机机集中润滑泵', '1485705600', '1', '800', null, '2700', '1', '0', null, '1', '10209288', '100', '1508569212', '1508569212');
INSERT INTO `info_warning` VALUES ('35', '100', '2', '10020172', '一号破碎站', '一号破碎站板式给料机右侧电动机后端轴承', '1490111999', '1', '0', null, '3500', '1', '0', null, '1', '10209358', '13.69', '1508569238', '1508569238');

-- ----------------------------
-- Table structure for oil_analysis
-- ----------------------------
DROP TABLE IF EXISTS `oil_analysis`;
CREATE TABLE `oil_analysis` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `equ_no` int(11) NOT NULL DEFAULT '0' COMMENT '设备名称编号',
  `equ_oil_no` int(11) NOT NULL DEFAULT '0' COMMENT '润滑点编号',
  `equ_key_no` int(10) DEFAULT NULL,
  `equ_name` varchar(100) DEFAULT NULL,
  `equ_oil_name` varchar(255) DEFAULT NULL,
  `sampling_time` int(15) DEFAULT NULL COMMENT '采样日期',
  `work_hour` int(20) DEFAULT NULL,
  `oil_no` int(20) DEFAULT NULL,
  `Fe` varchar(10) DEFAULT NULL,
  `Cu` varchar(10) DEFAULT NULL,
  `Al` varchar(10) DEFAULT NULL,
  `Si` varchar(10) DEFAULT NULL,
  `Na` varchar(10) DEFAULT NULL,
  `PQ` varchar(10) DEFAULT NULL COMMENT 'PQ',
  `viscosity` varchar(10) DEFAULT NULL COMMENT '粘度',
  `oil_status` varchar(50) DEFAULT '正常' COMMENT '油脂状态',
  `advise` int(1) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oil_analysis
-- ----------------------------
INSERT INTO `oil_analysis` VALUES ('1', '100', '2', '10020172', '一号破碎站', '一号破碎站板式给料机右侧电动机后端轴承', '1483372800', '0', '10209358', '1.72', '11.30', '1.09', '2.40', '2.05', '2.35', '15.9', 'Cu元素超标<br>PQ值超标', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('2', '100', '9', '10020179', '一号破碎站', '一号破碎站板式给料机头轮左侧轴承', '1483977600', '800', '10209313', '1.16', '0.99', '0.39', '2.80', '1.73', '2.35', '15.2', 'PQ值超标', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('3', '100', '10', '100201710', '一号破碎站', '一号破碎站板式给料机尾轮左侧轴承', '1484064000', '800', '10209315', '1.37', '0.22', '0.00', '1.22', '2.18', '2.35', '16.1', 'PQ值超标<br>粘度偏高', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('4', '100', '12', '100201712', '一号破碎站', '一号破碎站板式给料机集中润滑泵', '1484236800', '800', '10209315', '4.29', '0.59', '0.00', '11.36', '2.72', '2.35', '16.7', 'Fe元素超标<br>Si元素超标<br>PQ值超标<br>粘度偏高', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('5', '100', '13', '100201713', '一号破碎站', '一号破碎站破碎机电机', '1484323200', '800', '10209315', '2.28', '1.48', '0.23', '3.04', '3.33', '2.35', '17.3', 'PQ值超标<br>粘度偏高', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('6', '100', '14', '100201714', '一号破碎站', '一号破碎站破碎机偶合器', '1484409600', '800', '10209288', '0.37', '4.18', '0.00', '0.61', '1.71', '2.35', '15.1', 'PQ值超标', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('7', '100', '15', '100201715', '一号破碎站', '一号破碎站破碎机减速机', '1484496000', '800', '10209315', '3.63', '0.82', '0.00', '0.65', '18.41', '2.35', '15.0', 'Fe元素超标<br>Na元素超标<br>PQ值超标', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('8', '100', '16', '100201716', '一号破碎站', '一号破碎站破碎机同步齿轮箱', '1484582400', '800', '10209315', '0.44', '1.18', '0.28', '0.29', '0.36', '2.35', '45.5', 'PQ值超标<br>粘度偏高', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('9', '100', '17', '100201717', '一号破碎站', '一号破碎站破碎机机集中润滑泵', '1484668800', '800', '10209288', '5.27', '2.36', '10.18', '18.28', '1.89', '2.35', '47.2', 'Fe元素超标<br>Al元素超标<br>Si元素超标<br>PQ值超标<br>粘度偏高', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('10', '200', '1', '20020171', '二号破碎站', '二号破碎站板式给料机左侧电动机前端轴承', '1484755200', '6351', '11249923', '2.94', '1.21', '0.00', '0.62', '2.93', '2.35', '15.9', '', '1', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('11', '200', '2', '20020172', '二号破碎站', '二号破碎站板式给料机右侧电动机后端轴承', '1484841600', '800', '10209348', '0.79', '7.21', '0.00', '1.99', '2.15', '2.35', '17.0', 'Cu元素超标<br>PQ值超标<br>粘度偏高', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('12', '200', '3', '20020173', '二号破碎站', '二号破碎站板式给料机左侧电动机前端轴承', '1484928000', '6351', '10889994', '3.16', '0.71', '0.00', '1.80', '7.47', '2.35', '15.5', '', '1', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('13', '200', '4', '20020174', '二号破碎站', '二号破碎站板式给料机右侧电动后端轴承', '1485014400', '6351', '11249919', '0.50', '2.83', '0.00', '2.73', '1.16', '2.35', '16.2', '', '1', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('14', '200', '5', '20020175', '二号破碎站', '二号破碎站板式给料机左侧减速机', '1485100800', '6351', '11249919', '5.58', '1.31', '0.36', '4.52', '120.18', '2.35', '16.4', '', '1', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('15', '200', '6', '20020176', '二号破碎站', '二号破碎站板式给料机右侧减速机', '1485187200', '6351', '11249907', '0.90', '4.20', '0.00', '3.71', '1.82', '2.35', '30.2', '', '1', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('16', '200', '7', '20020177', '二号破碎站', '二号破碎站板式给料机低速联轴器', '1485273600', '6351', '10061964', '1.52', '7.80', '0.00', '7.31', '3.98', '2.35', '15.9', '', '1', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('17', '200', '8', '20020178', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '1485360000', '800', '10209315', '7.01', '1.33', '0.45', '1.09', '6.12', '2.35', '16.5', 'Fe元素超标<br>PQ值超标<br>粘度偏高', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('18', '200', '9', '20020179', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '1485446400', '800', '10209313', '0.40', '0.42', '0.00', '2.27', '1.91', '2.35', '16.5', 'PQ值超标<br>粘度偏高', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('19', '200', '10', '200201710', '二号破碎站', '二号破碎站板式给料机尾轮左侧轴承', '1485532800', '800', '10209315', '6.10', '0.83', '0.02', '5.05', '3.31', '2.35', '17.7', 'Fe元素超标<br>PQ值超标<br>粘度偏高', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('20', '200', '11', '200201711', '二号破碎站', '二号破碎站板式给料机尾轮右侧轴承', '1485619200', '6351', '11249919', '1.24', '1.07', '1.03', '15.00', '1.14', '2.35', '47.1', '', '1', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('21', '200', '12', '200201712', '二号破碎站', '二号破碎站板式给料机集中润滑泵', '1485705600', '800', '10209315', '0.42', '1.02', '0.00', '20.28', '2.18', '2.35', '11.0', 'Si元素超标<br>PQ值超标', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('22', '200', '13', '200201713', '二号破碎站', '二号破碎站破碎机电机', '1485792000', '800', '10209315', '2.12', '0.55', '0.00', '2.54', '2.58', '2.35', '14.4', 'PQ值超标', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('23', '200', '14', '200201714', '二号破碎站', '二号破碎站破碎机偶合器', '1485878400', '800', '10209288', '4.87', '6.92', '0.59', '3.09', '0.22', '2.35', '404.6', 'Fe元素超标<br>Cu元素超标<br>PQ值超标<br>粘度偏高', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('24', '200', '15', '200201715', '二号破碎站', '二号破碎站破碎机减速机', '1485964800', '0', '10209315', '4.75', '3.90', '110.91', '7.53', '3.30', '2.35', '11.5', 'Fe元素超标<br>Al元素超标<br>PQ值超标', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('25', '200', '16', '200201716', '二号破碎站', '二号破碎站破碎机同步齿轮箱', '1486051200', '0', '10209315', '0.50', '2.83', '0.00', '2.73', '1.16', '2.35', '16.2', 'PQ值超标<br>粘度偏高', '0', '1508569289', '1508569289');
INSERT INTO `oil_analysis` VALUES ('26', '200', '17', '200201717', '二号破碎站', '二号破碎站破碎机机集中润滑泵', '1486137600', '0', '10209288', '5.58', '1.31', '0.36', '4.52', '120.18', '2.35', '16.4', 'Fe元素超标<br>Na元素超标<br>PQ值超标<br>粘度偏高', '0', '1508569289', '1508569289');

-- ----------------------------
-- Table structure for oil_config
-- ----------------------------
DROP TABLE IF EXISTS `oil_config`;
CREATE TABLE `oil_config` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `postpone` int(10) DEFAULT '0',
  `update_time` int(11) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oil_config
-- ----------------------------
INSERT INTO `oil_config` VALUES ('1', '500', '1508224636', null);

-- ----------------------------
-- Table structure for oil_detail
-- ----------------------------
DROP TABLE IF EXISTS `oil_detail`;
CREATE TABLE `oil_detail` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `oil_no` int(11) DEFAULT NULL COMMENT '物料编码',
  `oil_name` varchar(150) DEFAULT NULL COMMENT '润滑油名称',
  `detail` varchar(255) DEFAULT NULL COMMENT '物料描述',
  `unit` varchar(10) DEFAULT NULL COMMENT '单位',
  `price` varchar(10) DEFAULT NULL COMMENT '价格',
  `Fe` varchar(10) DEFAULT NULL,
  `Cu` varchar(10) DEFAULT NULL,
  `Al` varchar(10) DEFAULT NULL,
  `Si` varchar(10) DEFAULT NULL,
  `Na` varchar(10) DEFAULT NULL,
  `PQ` varchar(10) DEFAULT NULL,
  `viscosity_max` varchar(10) DEFAULT NULL,
  `viscosity_min` varchar(10) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `oil_detail_id_uindex` (`id`),
  UNIQUE KEY `oil_detail_oil_no_uindex` (`oil_no`)
) ENGINE=MyISAM AUTO_INCREMENT=21 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oil_detail
-- ----------------------------
INSERT INTO `oil_detail` VALUES ('1', '10209358', '抗磨液压油', 'DTE 25;VG46;1×208L\\美孚', 'L', '20.56', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('2', '10209348', '抗磨液压油', 'DTE 10 超凡 15;VG15;1×208L\\美孚', 'L', '21.34', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('3', '10209351', '抗磨液压油', 'DTE 10 超凡 32;VG32;1×208L\\美孚', 'L', '21.70', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('4', '10209286', '超级齿轮油', '600 XP 220;VG220;1×208L\\美孚', 'L', '17.01', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('5', '10209288', '超级齿轮油', '600 XP 320;VG320;1×208L\\美孚', 'L', '18.61', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('6', '10209289', '超级齿轮油', '600 XP 460;VG460;1×208L\\美孚', 'L', '18.77', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('7', '11102440', '液力传动油', '6#;1×170kg;200L\\昆仑', 'L', '12.60', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('8', '10209398', '传动油', '424;1×208L\\美孚', 'L', '24.30', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('9', '10209313', '合成齿轮油', 'SHC 626;VG68;1×208L\\美孚', 'L', '98.03', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('10', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '98.89', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('11', '11249919', '极压锂基润滑脂', '尚博 0#;1×17kg\\长城', 'KG', '14.03', null, null, null, null, null, null, null, null, '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('12', '10061964', '极压锂基润滑脂', '尚博 3#;1×17kg\\长城', 'KG', '13.98', null, null, null, null, null, null, null, null, '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('13', '11249923', '通用锂基脂', '尚博 0#;1×17kg\\长城', 'KG', '12.95', null, null, null, null, null, null, null, null, '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('14', '11249924', '通用锂基脂', '尚博 1#;1×17kg\\长城', 'KG', '12.95', null, null, null, null, null, null, null, null, '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('15', '10889994', '通用锂基脂', '尚博 2#;1×17kg\\长城', 'KG', '12.95', null, null, null, null, null, null, null, null, '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('16', '10889996', '通用锂基脂', '尚博 3#;1×17kg\\长城', 'KG', '13.64', null, null, null, null, null, null, null, null, '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('17', '11249907', '二硫化钼锂基润滑脂', '尚博 0#;1×17KG\\长城', 'KG', '15.25', null, null, null, null, null, null, null, null, '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('18', '10705085', '二硫化钼锂基润滑脂', '尚博 2#;1×17KG\\长城', 'KG', '15.11', null, null, null, null, null, null, null, null, '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('19', '11249914', '高温高速润滑脂', 'HTHS 2#;1×17kg\\长城', 'KG', '34.53', null, null, null, null, null, null, null, null, '1508569158', '1508569158');
INSERT INTO `oil_detail` VALUES ('20', '10209438', '复合锂基润滑脂', '力富 SHC 100;NLGI 2;1×16kg\\美孚', 'KG', '121.50', null, null, null, null, null, null, null, null, '1508569158', '1508569158');

-- ----------------------------
-- Table structure for oil_no_list
-- ----------------------------
DROP TABLE IF EXISTS `oil_no_list`;
CREATE TABLE `oil_no_list` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `equ_no` int(11) DEFAULT NULL,
  `equ_key_no` int(11) DEFAULT NULL,
  `oil_no` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=754 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oil_no_list
-- ----------------------------
INSERT INTO `oil_no_list` VALUES ('690', '100', '10020171', '11249923');
INSERT INTO `oil_no_list` VALUES ('691', '100', '10020171', '11249924');
INSERT INTO `oil_no_list` VALUES ('692', '100', '10020171', '10889994');
INSERT INTO `oil_no_list` VALUES ('693', '100', '10020171', '10889996');
INSERT INTO `oil_no_list` VALUES ('694', '100', '10020172', '10209358');
INSERT INTO `oil_no_list` VALUES ('695', '100', '10020172', '10209348');
INSERT INTO `oil_no_list` VALUES ('696', '100', '10020172', '10209351');
INSERT INTO `oil_no_list` VALUES ('697', '100', '10020173', '11249923');
INSERT INTO `oil_no_list` VALUES ('698', '100', '10020173', '11249924');
INSERT INTO `oil_no_list` VALUES ('699', '100', '10020173', '10889994');
INSERT INTO `oil_no_list` VALUES ('700', '100', '10020173', '10889996');
INSERT INTO `oil_no_list` VALUES ('701', '100', '10020174', '10061964');
INSERT INTO `oil_no_list` VALUES ('702', '100', '10020174', '11249919');
INSERT INTO `oil_no_list` VALUES ('703', '100', '10020175', '11249907');
INSERT INTO `oil_no_list` VALUES ('704', '100', '10020175', '10705085');
INSERT INTO `oil_no_list` VALUES ('705', '100', '10020176', '11249907');
INSERT INTO `oil_no_list` VALUES ('706', '100', '10020176', '10705085');
INSERT INTO `oil_no_list` VALUES ('707', '100', '10020177', '11249919');
INSERT INTO `oil_no_list` VALUES ('708', '100', '10020177', '10061964');
INSERT INTO `oil_no_list` VALUES ('709', '100', '10020178', '10209315');
INSERT INTO `oil_no_list` VALUES ('710', '100', '10020179', '10209313');
INSERT INTO `oil_no_list` VALUES ('711', '100', '100201710', '10209315');
INSERT INTO `oil_no_list` VALUES ('712', '100', '100201711', '11249919');
INSERT INTO `oil_no_list` VALUES ('713', '100', '100201712', '10209315');
INSERT INTO `oil_no_list` VALUES ('714', '100', '100201713', '10209315');
INSERT INTO `oil_no_list` VALUES ('715', '100', '100201714', '10209288');
INSERT INTO `oil_no_list` VALUES ('716', '100', '100201715', '10209315');
INSERT INTO `oil_no_list` VALUES ('717', '100', '100201716', '10209313');
INSERT INTO `oil_no_list` VALUES ('718', '100', '100201716', '10209315');
INSERT INTO `oil_no_list` VALUES ('719', '100', '100201716', '10209288');
INSERT INTO `oil_no_list` VALUES ('720', '100', '100201716', '10209289');
INSERT INTO `oil_no_list` VALUES ('721', '100', '100201717', '10209288');
INSERT INTO `oil_no_list` VALUES ('722', '200', '20020171', '11249923');
INSERT INTO `oil_no_list` VALUES ('723', '200', '20020171', '11249924');
INSERT INTO `oil_no_list` VALUES ('724', '200', '20020171', '10889994');
INSERT INTO `oil_no_list` VALUES ('725', '200', '20020171', '10889996');
INSERT INTO `oil_no_list` VALUES ('726', '200', '20020172', '10209358');
INSERT INTO `oil_no_list` VALUES ('727', '200', '20020172', '10209348');
INSERT INTO `oil_no_list` VALUES ('728', '200', '20020172', '10209351');
INSERT INTO `oil_no_list` VALUES ('729', '200', '20020173', '11249923');
INSERT INTO `oil_no_list` VALUES ('730', '200', '20020173', '11249924');
INSERT INTO `oil_no_list` VALUES ('731', '200', '20020173', '10889994');
INSERT INTO `oil_no_list` VALUES ('732', '200', '20020173', '10889996');
INSERT INTO `oil_no_list` VALUES ('733', '200', '20020174', '10061964');
INSERT INTO `oil_no_list` VALUES ('734', '200', '20020174', '11249919');
INSERT INTO `oil_no_list` VALUES ('735', '200', '20020175', '11249907');
INSERT INTO `oil_no_list` VALUES ('736', '200', '20020175', '10705085');
INSERT INTO `oil_no_list` VALUES ('737', '200', '20020176', '11249907');
INSERT INTO `oil_no_list` VALUES ('738', '200', '20020176', '10705085');
INSERT INTO `oil_no_list` VALUES ('739', '200', '20020177', '11249919');
INSERT INTO `oil_no_list` VALUES ('740', '200', '20020177', '10061964');
INSERT INTO `oil_no_list` VALUES ('741', '200', '20020178', '10209315');
INSERT INTO `oil_no_list` VALUES ('742', '200', '20020179', '10209313');
INSERT INTO `oil_no_list` VALUES ('743', '200', '200201710', '10209315');
INSERT INTO `oil_no_list` VALUES ('744', '200', '200201711', '11249919');
INSERT INTO `oil_no_list` VALUES ('745', '200', '200201712', '10209315');
INSERT INTO `oil_no_list` VALUES ('746', '200', '200201713', '10209315');
INSERT INTO `oil_no_list` VALUES ('747', '200', '200201714', '10209288');
INSERT INTO `oil_no_list` VALUES ('748', '200', '200201715', '10209315');
INSERT INTO `oil_no_list` VALUES ('749', '200', '200201716', '10209313');
INSERT INTO `oil_no_list` VALUES ('750', '200', '200201716', '10209315');
INSERT INTO `oil_no_list` VALUES ('751', '200', '200201716', '10209288');
INSERT INTO `oil_no_list` VALUES ('752', '200', '200201716', '10209289');
INSERT INTO `oil_no_list` VALUES ('753', '200', '200201717', '10209288');

-- ----------------------------
-- Table structure for oil_standard
-- ----------------------------
DROP TABLE IF EXISTS `oil_standard`;
CREATE TABLE `oil_standard` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `equ_no` int(11) NOT NULL DEFAULT '0' COMMENT '设备编号',
  `equ_oil_no` int(11) NOT NULL DEFAULT '0' COMMENT '润滑点编号',
  `equ_key_no` int(10) DEFAULT NULL,
  `equ_name` varchar(255) DEFAULT '' COMMENT '设备名称',
  `equ_oil_name` varchar(100) NOT NULL DEFAULT '' COMMENT '润滑点全称',
  `oil_no` int(10) DEFAULT NULL,
  `quantity` varchar(10) NOT NULL DEFAULT '0' COMMENT '用量',
  `first_period` int(10) NOT NULL DEFAULT '0' COMMENT '首保周期',
  `period` int(10) NOT NULL DEFAULT '0' COMMENT '更换最长周期',
  `interval` int(10) NOT NULL DEFAULT '0' COMMENT '油脂采样间隔',
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `oil_standard_id_uindex` (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=35 DEFAULT CHARSET=utf8 COMMENT='润滑标准样表';

-- ----------------------------
-- Records of oil_standard
-- ----------------------------
INSERT INTO `oil_standard` VALUES ('1', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '10889994', '100', '500', '3500', '500', '1508569189', '1508569433');
INSERT INTO `oil_standard` VALUES ('2', '100', '2', '10020172', '一号破碎站', '一号破碎站板式给料机右侧电动机后端轴承', '10209358', '100', '500', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('3', '100', '3', '10020173', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '10889994', '100', '500', '3500', '500', '1508569189', '1508569431');
INSERT INTO `oil_standard` VALUES ('4', '100', '4', '10020174', '一号破碎站', '一号破碎站板式给料机右侧电动后端轴承', '10061964', '100', '500', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('5', '100', '5', '10020175', '一号破碎站', '一号破碎站板式给料机左侧减速机', '10705085', '100', '500', '3500', '500', '1508569189', '1508569436');
INSERT INTO `oil_standard` VALUES ('6', '100', '6', '10020176', '一号破碎站', '一号破碎站板式给料机右侧减速机', '10705085', '100', '500', '3500', '500', '1508569189', '1508569438');
INSERT INTO `oil_standard` VALUES ('7', '100', '7', '10020177', '一号破碎站', '一号破碎站板式给料机低速联轴器', '10061964', '100', '500', '3500', '500', '1508569189', '1508569430');
INSERT INTO `oil_standard` VALUES ('8', '100', '8', '10020178', '一号破碎站', '一号破碎站板式给料机头轮左侧轴承', '10209315', '100', '0', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('9', '100', '9', '10020179', '一号破碎站', '一号破碎站板式给料机头轮左侧轴承', '10209313', '100', '0', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('10', '100', '10', '100201710', '一号破碎站', '一号破碎站板式给料机尾轮左侧轴承', '10209315', '100', '0', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('11', '100', '11', '100201711', '一号破碎站', '一号破碎站板式给料机尾轮右侧轴承', '11249919', '100', '0', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('12', '100', '12', '100201712', '一号破碎站', '一号破碎站板式给料机集中润滑泵', '10209315', '100', '0', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('13', '100', '13', '100201713', '一号破碎站', '一号破碎站破碎机电机', '10209315', '100', '0', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('14', '100', '14', '100201714', '一号破碎站', '一号破碎站破碎机偶合器', '10209288', '100', '500', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('15', '100', '15', '100201715', '一号破碎站', '一号破碎站破碎机减速机', '10209315', '100', '500', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('16', '100', '16', '100201716', '一号破碎站', '一号破碎站破碎机同步齿轮箱', '10209288', '100', '500', '3500', '500', '1508569189', '1508569442');
INSERT INTO `oil_standard` VALUES ('17', '100', '17', '100201717', '一号破碎站', '一号破碎站破碎机机集中润滑泵', '10209288', '100', '0', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('18', '200', '1', '20020171', '二号破碎站', '二号破碎站板式给料机左侧电动机前端轴承', '11249923', '100', '500', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('19', '200', '2', '20020172', '二号破碎站', '二号破碎站板式给料机右侧电动机后端轴承', '10209358', '100', '500', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('20', '200', '3', '20020173', '二号破碎站', '二号破碎站板式给料机左侧电动机前端轴承', '11249923', '100', '500', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('21', '200', '4', '20020174', '二号破碎站', '二号破碎站板式给料机右侧电动后端轴承', '10061964', '100', '500', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('22', '200', '5', '20020175', '二号破碎站', '二号破碎站板式给料机左侧减速机', '11249907', '100', '500', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('23', '200', '6', '20020176', '二号破碎站', '二号破碎站板式给料机右侧减速机', '11249907', '100', '500', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('24', '200', '7', '20020177', '二号破碎站', '二号破碎站板式给料机低速联轴器', '11249919', '100', '500', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('25', '200', '8', '20020178', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '10209315', '100', '0', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('26', '200', '9', '20020179', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '10209313', '100', '0', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('27', '200', '10', '200201710', '二号破碎站', '二号破碎站板式给料机尾轮左侧轴承', '10209315', '100', '0', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('28', '200', '11', '200201711', '二号破碎站', '二号破碎站板式给料机尾轮右侧轴承', '11249919', '100', '0', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('29', '200', '12', '200201712', '二号破碎站', '二号破碎站板式给料机集中润滑泵', '10209315', '100', '0', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('30', '200', '13', '200201713', '二号破碎站', '二号破碎站破碎机电机', '10209315', '100', '0', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('31', '200', '14', '200201714', '二号破碎站', '二号破碎站破碎机偶合器', '10209288', '100', '500', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('32', '200', '15', '200201715', '二号破碎站', '二号破碎站破碎机减速机', '10209315', '100', '500', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('33', '200', '16', '200201716', '二号破碎站', '二号破碎站破碎机同步齿轮箱', '10209313', '100', '500', '3500', '500', '1508569189', '1508569189');
INSERT INTO `oil_standard` VALUES ('34', '200', '17', '200201717', '二号破碎站', '二号破碎站破碎机机集中润滑泵', '10209288', '100', '0', '3500', '500', '1508569189', '1508569189');

-- ----------------------------
-- Table structure for oil_used
-- ----------------------------
DROP TABLE IF EXISTS `oil_used`;
CREATE TABLE `oil_used` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `equ_key_no` int(11) DEFAULT NULL,
  `del_warning_time` int(11) DEFAULT NULL,
  `oil_no` int(11) DEFAULT NULL,
  `oil_name` varchar(50) DEFAULT NULL,
  `detail` varchar(200) DEFAULT NULL,
  `unit` varchar(5) DEFAULT NULL,
  `quantity` varchar(11) DEFAULT NULL,
  `price` varchar(10) DEFAULT NULL,
  `cost` varchar(10) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=35 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oil_used
-- ----------------------------
INSERT INTO `oil_used` VALUES ('1', '10020171', '1485705600', '11249923', '通用锂基脂', '尚博 0#;1×17kg\\长城', 'KG', '100', '12.95', '1295', '1508569211', '1508569211');
INSERT INTO `oil_used` VALUES ('2', '10020172', '1485705600', '10209348', '抗磨液压油', 'DTE 10 超凡 15;VG15;1×208L\\美孚', 'L', '100', '21.34', '2134', '1508569211', '1508569211');
INSERT INTO `oil_used` VALUES ('3', '10020174', '1485705600', '11249919', '极压锂基润滑脂', '尚博 0#;1×17kg\\长城', 'KG', '100', '14.03', '1403', '1508569211', '1508569211');
INSERT INTO `oil_used` VALUES ('4', '10020175', '1485705600', '11249919', '极压锂基润滑脂', '尚博 0#;1×17kg\\长城', 'KG', '100', '14.03', '1403', '1508569211', '1508569211');
INSERT INTO `oil_used` VALUES ('5', '10020176', '1485705600', '11249907', '二硫化钼锂基润滑脂', '尚博 0#;1×17KG\\长城', 'KG', '100', '15.25', '1525', '1508569211', '1508569211');
INSERT INTO `oil_used` VALUES ('6', '10020177', '1485705600', '10061964', '极压锂基润滑脂', '尚博 3#;1×17kg\\长城', 'KG', '100', '13.98', '1398', '1508569211', '1508569211');
INSERT INTO `oil_used` VALUES ('7', '10020178', '1485705600', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('8', '10020179', '1485705600', '10209313', '合成齿轮油', 'SHC 626;VG68;1×208L\\美孚', 'L', '100', '98.03', '9803', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('9', '100201710', '1485705600', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('10', '100201711', '1485705600', '11249919', '极压锂基润滑脂', '尚博 0#;1×17kg\\长城', 'KG', '100', '14.03', '1403', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('11', '100201712', '1485705600', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('12', '100201713', '1485705600', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('13', '100201714', '1485705600', '10209288', '超级齿轮油', '600 XP 320;VG320;1×208L\\美孚', 'L', '100', '18.61', '1861', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('14', '100201715', '1485705600', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('15', '100201716', '1485705600', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('16', '100201717', '1485705600', '10209288', '超级齿轮油', '600 XP 320;VG320;1×208L\\美孚', 'L', '100', '18.61', '1861', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('17', '20020171', '1485705600', '11249923', '通用锂基脂', '尚博 0#;1×17kg\\长城', 'KG', '100', '12.95', '1295', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('18', '20020172', '1485705600', '10209348', '抗磨液压油', 'DTE 10 超凡 15;VG15;1×208L\\美孚', 'L', '100', '21.34', '2134', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('19', '20020173', '1485705600', '10889994', '通用锂基脂', '尚博 2#;1×17kg\\长城', 'KG', '100', '12.95', '1295', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('20', '20020174', '1485705600', '11249919', '极压锂基润滑脂', '尚博 0#;1×17kg\\长城', 'KG', '100', '14.03', '1403', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('21', '20020175', '1485705600', '11249919', '极压锂基润滑脂', '尚博 0#;1×17kg\\长城', 'KG', '100', '14.03', '1403', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('22', '20020176', '1485705600', '11249907', '二硫化钼锂基润滑脂', '尚博 0#;1×17KG\\长城', 'KG', '100', '15.25', '1525', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('23', '20020177', '1485705600', '10061964', '极压锂基润滑脂', '尚博 3#;1×17kg\\长城', 'KG', '100', '13.98', '1398', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('24', '20020178', '1485705600', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('25', '20020179', '1485705600', '10209313', '合成齿轮油', 'SHC 626;VG68;1×208L\\美孚', 'L', '100', '98.03', '9803', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('26', '200201710', '1485705600', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('27', '200201711', '1485705600', '11249919', '极压锂基润滑脂', '尚博 0#;1×17kg\\长城', 'KG', '100', '14.03', '1403', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('28', '200201712', '1485705600', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('29', '200201713', '1485705600', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('30', '200201714', '1485705600', '10209288', '超级齿轮油', '600 XP 320;VG320;1×208L\\美孚', 'L', '100', '18.61', '1861', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('31', '200201715', '1485705600', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('32', '200201716', '1485705600', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('33', '200201717', '1485705600', '10209288', '超级齿轮油', '600 XP 320;VG320;1×208L\\美孚', 'L', '100', '18.61', '1861', '1508569212', '1508569212');
INSERT INTO `oil_used` VALUES ('34', '10020172', '1490111999', '10209358', '抗磨液压油', 'DTE 25;VG46;1×208L\\美孚', 'L', '13.69', '20.56', '281.4664', '1508569238', '1508569238');

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `account` varchar(30) NOT NULL,
  `password` char(32) NOT NULL,
  `scope` tinyint(2) DEFAULT NULL COMMENT '权限 1：超级管理员 2：系统维护员 3：普通工作人员',
  `name` varchar(10) DEFAULT NULL,
  `phone` char(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `user_account_uindex` (`account`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('1', 'admin', 'e10adc3949ba59abbe56e057f20f883e', '36', 'admin', '15148936547', '1508227946', null);
INSERT INTO `user` VALUES ('4', 'runhua1', 'e10adc3949ba59abbe56e057f20f883e', '18', '王宝强', '', '1508311122', '1506419665');
INSERT INTO `user` VALUES ('5', 'runhua2', 'e10adc3949ba59abbe56e057f20f883e', '9', '宋伟', '', '1506419689', '1506419689');
INSERT INTO `user` VALUES ('6', 'runhua3', '4297f44b13955235245b2497399d7a93', '9', '黄晓明', '15641369632', '1508393507', '1508393507');

-- ----------------------------
-- Table structure for work_hour
-- ----------------------------
DROP TABLE IF EXISTS `work_hour`;
CREATE TABLE `work_hour` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `equ_no` int(11) NOT NULL COMMENT '设备编号',
  `equ_name` varchar(100) DEFAULT NULL COMMENT '润滑点名称',
  `working_hour` int(100) NOT NULL,
  `start_time` int(100) DEFAULT NULL,
  `create_time` int(100) DEFAULT NULL,
  `update_time` int(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of work_hour
-- ----------------------------
INSERT INTO `work_hour` VALUES ('1', '100', '一号破碎站', '800', '1483200000', '1508569203', '1508569203');
INSERT INTO `work_hour` VALUES ('2', '200', '二号破碎站', '800', '1483200000', '1508569203', '1508569203');
INSERT INTO `work_hour` VALUES ('3', '100', '一号破碎站', '800', '1485878400', '1508569203', '1508569203');
INSERT INTO `work_hour` VALUES ('4', '200', '二号破碎站', '800', '1485878400', '1508569203', '1508569203');
