/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50553
Source Host           : localhost:3306
Source Database       : shenhua

Target Server Type    : MYSQL
Target Server Version : 50553
File Encoding         : 65001

Date: 2017-10-20 17:39:11
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for equipment
-- ----------------------------
DROP TABLE IF EXISTS `equipment`;
CREATE TABLE `equipment` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `equ_no` int(10) NOT NULL DEFAULT '0',
  `equ_name` varchar(50) NOT NULL DEFAULT '',
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of equipment
-- ----------------------------
INSERT INTO `equipment` VALUES ('3', '100', '一号破碎站', '1508484301', '1508484301');
INSERT INTO `equipment` VALUES ('4', '200', '二号破碎站', '1508484315', '1508484315');

-- ----------------------------
-- Table structure for info_warning
-- ----------------------------
DROP TABLE IF EXISTS `info_warning`;
CREATE TABLE `info_warning` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `equ_no` int(11) NOT NULL COMMENT '设备编号',
  `equ_oil_no` int(11) NOT NULL COMMENT '润滑点编号',
  `equ_key_no` int(10) DEFAULT NULL,
  `equ_name` varchar(100) DEFAULT NULL COMMENT '设备名称',
  `equ_oil_name` varchar(255) DEFAULT NULL COMMENT '润滑点名称',
  `del_warning_time` varchar(100) DEFAULT NULL,
  `warning_type` tinyint(1) DEFAULT NULL COMMENT '1:润滑 0:延期 ',
  `how_long` int(11) DEFAULT NULL COMMENT '距离上次润滑的运行时长',
  `postpone` int(10) DEFAULT NULL COMMENT '延期时长',
  `deadline` int(10) DEFAULT NULL COMMENT '润滑截止日期',
  `status` tinyint(1) DEFAULT NULL,
  `is_first_period` tinyint(1) DEFAULT NULL COMMENT '是否在首保周期',
  `postpone_reason` varchar(255) DEFAULT NULL COMMENT '延期原因',
  `user_id` int(10) DEFAULT NULL COMMENT '操作人员',
  `oil_no` int(11) DEFAULT NULL COMMENT '物料编号',
  `quantity` int(10) DEFAULT NULL COMMENT '用量',
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=72 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of info_warning
-- ----------------------------
INSERT INTO `info_warning` VALUES ('63', '200', '12', '200201712', '二号破碎站', '二号破碎站板式给料机集中润滑泵', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209315', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('62', '200', '11', '200201711', '二号破碎站', '二号破碎站板式给料机尾轮右侧轴承', '1483372800', '1', '6978', null, '-3478', '3', '0', null, '1', '11249919', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('61', '200', '10', '200201710', '二号破碎站', '二号破碎站板式给料机尾轮左侧轴承', '1483372800', '1', '360', null, '-360', '3', '1', null, '1', '10209315', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('60', '200', '9', '20020179', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209313', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('59', '200', '8', '20020178', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209315', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('58', '200', '7', '20020177', '二号破碎站', '二号破碎站板式给料机低速联轴器', '1483372800', '1', '6978', null, '-3478', '3', '0', null, '1', '10061964', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('57', '200', '6', '20020176', '二号破碎站', '二号破碎站板式给料机右侧减速机', '1483372800', '1', '6978', null, '-3478', '3', '0', null, '1', '11249907', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('56', '200', '5', '20020175', '二号破碎站', '二号破碎站板式给料机左侧减速机', '1483372800', '1', '6978', null, '-3478', '3', '0', null, '1', '11249919', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('55', '200', '4', '20020174', '二号破碎站', '二号破碎站板式给料机右侧电动后端轴承', '1483372800', '1', '6978', null, '-3478', '3', '0', null, '1', '11249919', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('54', '200', '3', '20020173', '二号破碎站', '二号破碎站板式给料机左侧电动机前端轴承', '1483372800', '1', '6978', null, '-3478', '3', '0', null, '1', '10889994', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('52', '200', '1', '20020171', '二号破碎站', '二号破碎站板式给料机右侧电动机后端轴承', '1483372800', '1', '6978', null, '-3478', '3', '0', null, '1', '11249923', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('48', '100', '14', '100201714', '一号破碎站', '一号破碎站破碎机偶合器', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209288', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('49', '100', '15', '100201715', '一号破碎站', '一号破碎站破碎机减速机', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209315', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('50', '100', '16', '100201716', '一号破碎站', '一号破碎站破碎机同步齿轮箱', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209315', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('47', '100', '13', '100201713', '一号破碎站', '一号破碎站破碎机电机', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209315', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('46', '100', '12', '100201712', '一号破碎站', '一号破碎站板式给料机集中润滑泵', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209315', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('45', '100', '11', '100201711', '一号破碎站', '一号破碎站板式给料机尾轮右侧轴承', '1483372800', '1', '6978', null, '-3478', '3', '0', null, '1', '11249919', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('44', '100', '10', '100201710', '一号破碎站', '一号破碎站板式给料机尾轮左侧轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209315', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('43', '100', '9', '10020179', '一号破碎站', '一号破碎站板式给料机头轮左侧轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209313', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('42', '100', '8', '10020178', '一号破碎站', '一号破碎站板式给料机头轮左侧轴承', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209315', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('41', '100', '7', '10020177', '一号破碎站', '一号破碎站板式给料机低速联轴器', '1483372800', '1', '0', null, '3500', '1', '0', null, '1', '10061964', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('40', '100', '6', '10020176', '一号破碎站', '一号破碎站板式给料机右侧减速机', '1483372800', '1', '6978', null, '-3478', '3', '0', null, '1', '11249907', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('37', '100', '3', '10020173', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '1483372800', '0', '0', '300', '800', '1', '1', '设备维修', '1', null, null, '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('39', '100', '5', '10020175', '一号破碎站', '一号破碎站板式给料机左侧减速机', '1483372800', '1', '0', null, '3500', '1', '0', null, '1', '11249919', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('38', '100', '4', '10020174', '一号破碎站', '一号破碎站板式给料机右侧电动后端轴承', '1483372800', '1', '6978', null, '-3478', '3', '0', null, '1', '11249919', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('64', '200', '13', '200201713', '二号破碎站', '二号破碎站破碎机电机', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209315', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('65', '200', '14', '200201714', '二号破碎站', '二号破碎站破碎机偶合器', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209288', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('66', '200', '15', '200201715', '二号破碎站', '二号破碎站破碎机减速机', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209315', '100', '1508462625', '1508462625');
INSERT INTO `info_warning` VALUES ('67', '200', '16', '200201716', '二号破碎站', '二号破碎站破碎机同步齿轮箱', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209315', '100', '1508462626', '1508462626');
INSERT INTO `info_warning` VALUES ('68', '200', '17', '200201717', '二号破碎站', '二号破碎站破碎机机集中润滑泵', '1483372800', '1', '360', null, '3140', '1', '0', null, '1', '10209288', '100', '1508462626', '1508462626');
INSERT INTO `info_warning` VALUES ('70', '100', '5', '10020175', '一号破碎站', '一号破碎站板式给料机左侧减速机', '1508515199', '1', '0', null, '3500', '1', '0', null, '1', '10705085', '100', '1508471926', '1508471926');
INSERT INTO `info_warning` VALUES ('71', '100', '7', '10020177', '一号破碎站', '一号破碎站板式给料机低速联轴器', '1508515199', '1', '0', null, '3500', '1', '0', null, '1', '10705085', '100', '1508471930', '1508471930');

-- ----------------------------
-- Table structure for oil_analysis
-- ----------------------------
DROP TABLE IF EXISTS `oil_analysis`;
CREATE TABLE `oil_analysis` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `equ_no` int(11) NOT NULL DEFAULT '0' COMMENT '设备名称编号',
  `equ_oil_no` int(11) NOT NULL DEFAULT '0' COMMENT '润滑点编号',
  `equ_key_no` int(10) DEFAULT NULL,
  `equ_name` varchar(100) DEFAULT NULL,
  `equ_oil_name` varchar(255) DEFAULT NULL,
  `sampling_time` int(15) DEFAULT NULL COMMENT '采样日期',
  `work_hour` int(20) DEFAULT NULL,
  `oil_no` int(20) DEFAULT NULL,
  `Fe` float(10,2) DEFAULT NULL,
  `Cu` float(10,2) DEFAULT NULL,
  `Al` float(10,2) DEFAULT NULL,
  `Si` float(10,2) DEFAULT NULL,
  `Na` float(10,2) DEFAULT NULL,
  `PQ` float(10,2) DEFAULT NULL COMMENT 'PQ',
  `viscosity` float(10,2) DEFAULT NULL COMMENT '粘度',
  `oil_status` varchar(50) DEFAULT '正常' COMMENT '油脂状态',
  `advise` int(1) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oil_analysis
-- ----------------------------
INSERT INTO `oil_analysis` VALUES ('1', '100', '2', '10020172', '一号破碎站', '一号破碎站板式给料机右侧电动机后端轴承', '1483372800', '800', '10209348', '1.72', '11.30', '1.09', '2.40', '2.05', '2.35', '15.90', 'Cu元素超标<br>PQ值超标', '0', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('2', '100', '9', '10020179', '一号破碎站', '一号破碎站板式给料机头轮左侧轴承', '1483977600', '800', '10209313', '1.16', '0.99', '0.39', '2.80', '1.73', '2.35', '15.20', 'PQ值超标', '0', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('3', '100', '10', '100201710', '一号破碎站', '一号破碎站板式给料机尾轮左侧轴承', '1484064000', '800', '10209315', '1.37', '0.22', '0.00', '1.22', '2.18', '2.35', '16.10', 'PQ值超标<br>粘度偏高', '0', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('4', '100', '12', '100201712', '一号破碎站', '一号破碎站板式给料机集中润滑泵', '1484236800', '800', '10209315', '4.29', '0.59', '0.00', '11.36', '2.72', '2.35', '16.70', 'Fe元素超标<br>Si元素超标<br>PQ值超标<br>粘度偏高', '0', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('5', '100', '13', '100201713', '一号破碎站', '一号破碎站破碎机电机', '1484323200', '800', '10209315', '2.28', '1.48', '0.23', '3.04', '3.33', '2.35', '17.30', 'PQ值超标<br>粘度偏高', '0', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('6', '100', '14', '100201714', '一号破碎站', '一号破碎站破碎机偶合器', '1484409600', '800', '10209288', '0.37', '4.18', '0.00', '0.61', '1.71', '2.35', '15.10', 'PQ值超标', '0', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('7', '100', '15', '100201715', '一号破碎站', '一号破碎站破碎机减速机', '1484496000', '800', '10209315', '3.63', '0.82', '0.00', '0.65', '18.41', '2.35', '15.00', 'Fe元素超标<br>Na元素超标<br>PQ值超标', '0', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('8', '100', '16', '100201716', '一号破碎站', '一号破碎站破碎机同步齿轮箱', '1484582400', '800', '10209315', '0.44', '1.18', '0.28', '0.29', '0.36', '2.35', '45.50', 'PQ值超标<br>粘度偏高', '0', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('10', '200', '1', '20020171', '二号破碎站', '二号破碎站板式给料机左侧电动机前端轴承', '1484755200', '6585', '11249923', '2.94', '1.21', '0.00', '0.62', '2.93', '2.35', '15.90', '', '1', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('11', '200', '2', '20020172', '二号破碎站', '二号破碎站板式给料机右侧电动机后端轴承', '1484841600', '800', '10209348', '0.79', '7.21', '0.00', '1.99', '2.15', '2.35', '17.00', 'Cu元素超标<br>PQ值超标<br>粘度偏高', '0', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('12', '200', '3', '20020173', '二号破碎站', '二号破碎站板式给料机左侧电动机前端轴承', '1484928000', '6537', '10889994', '3.16', '0.71', '0.00', '1.80', '7.47', '2.35', '15.50', '', '1', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('13', '200', '4', '20020174', '二号破碎站', '二号破碎站板式给料机右侧电动后端轴承', '1485014400', '6513', '11249919', '0.50', '2.83', '0.00', '2.73', '1.16', '2.35', '16.20', '', '1', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('14', '200', '5', '20020175', '二号破碎站', '二号破碎站板式给料机左侧减速机', '1485100800', '6489', '11249919', '5.58', '1.31', '0.36', '4.52', '120.18', '2.35', '16.40', '', '1', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('15', '200', '6', '20020176', '二号破碎站', '二号破碎站板式给料机右侧减速机', '1485187200', '6465', '11249907', '0.90', '4.20', '0.00', '3.71', '1.82', '2.35', '30.20', '', '1', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('16', '200', '7', '20020177', '二号破碎站', '二号破碎站板式给料机低速联轴器', '1485273600', '6441', '10061964', '1.52', '7.80', '0.00', '7.31', '3.98', '2.35', '15.90', '', '1', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('17', '200', '8', '20020178', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '1485360000', '800', '10209315', '7.01', '1.33', '0.45', '1.09', '6.12', '2.35', '16.50', 'Fe元素超标<br>PQ值超标<br>粘度偏高', '0', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('18', '200', '9', '20020179', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '1485446400', '800', '10209313', '0.40', '0.42', '0.00', '2.27', '1.91', '2.35', '16.50', 'PQ值超标<br>粘度偏高', '0', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('19', '200', '10', '200201710', '二号破碎站', '二号破碎站板式给料机尾轮左侧轴承', '1485532800', '800', '10209315', '6.10', '0.83', '0.02', '5.05', '3.31', '2.35', '17.70', 'Fe元素超标<br>PQ值超标<br>粘度偏高', '0', '1508462640', '1508462640');
INSERT INTO `oil_analysis` VALUES ('20', '200', '11', '200201711', '二号破碎站', '二号破碎站板式给料机尾轮右侧轴承', '1485619200', '6345', '11249919', '1.24', '1.07', '1.03', '15.00', '1.14', '2.35', '47.10', '', '1', '1508462641', '1508462641');
INSERT INTO `oil_analysis` VALUES ('21', '200', '12', '200201712', '二号破碎站', '二号破碎站板式给料机集中润滑泵', '1485705600', '800', '10209315', '0.42', '1.02', '0.00', '20.28', '2.18', '2.35', '11.00', 'Si元素超标<br>PQ值超标', '0', '1508462641', '1508462641');
INSERT INTO `oil_analysis` VALUES ('22', '200', '13', '200201713', '二号破碎站', '二号破碎站破碎机电机', '1485792000', '800', '10209315', '2.12', '0.55', '0.00', '2.54', '2.58', '2.35', '14.40', 'PQ值超标', '0', '1508462641', '1508462641');
INSERT INTO `oil_analysis` VALUES ('23', '200', '14', '200201714', '二号破碎站', '二号破碎站破碎机偶合器', '1485878400', '800', '10209288', '4.87', '6.92', '0.59', '3.09', '0.22', '2.35', '404.60', 'Fe元素超标<br>Cu元素超标<br>PQ值超标<br>粘度偏高', '0', '1508462641', '1508462641');
INSERT INTO `oil_analysis` VALUES ('24', '200', '15', '200201715', '二号破碎站', '二号破碎站破碎机减速机', '1485964800', '0', '10209315', '4.75', '3.90', '110.91', '7.53', '3.30', '2.35', '11.50', 'Fe元素超标<br>Al元素超标<br>PQ值超标', '0', '1508462641', '1508462641');
INSERT INTO `oil_analysis` VALUES ('25', '200', '16', '200201716', '二号破碎站', '二号破碎站破碎机同步齿轮箱', '1486051200', '0', '10209315', '0.50', '2.83', '0.00', '2.73', '1.16', '2.35', '16.20', 'PQ值超标<br>粘度偏高', '0', '1508462641', '1508462641');
INSERT INTO `oil_analysis` VALUES ('26', '200', '17', '200201717', '二号破碎站', '二号破碎站破碎机机集中润滑泵', '1486137600', '0', '10209288', '5.58', '1.31', '0.36', '4.52', '120.18', '2.35', '16.40', 'Fe元素超标<br>Na元素超标<br>PQ值超标<br>粘度偏高', '0', '1508462641', '1508462641');
INSERT INTO `oil_analysis` VALUES ('28', '100', '2', '10020172', '一号破碎站', '一号破碎站板式给料机右侧电动机后端轴承', '1487520000', '0', '10209348', '2.10', '3.60', '1.30', '2.10', '3.65', '2.30', '12.00', 'PQ值超标', '0', '1508485105', '1508485105');
INSERT INTO `oil_analysis` VALUES ('29', '100', '2', '10020172', '一号破碎站', '一号破碎站板式给料机右侧电动机后端轴承', '1489939200', '0', '10209348', '12.10', '13.60', '11.30', '12.10', '31.65', '12.30', '17.00', 'Fe元素超标<br>Cu元素超标<br>Al元素超标<br>Si元素超标<br>Na元素超标<br>', '0', '1508485122', '1508485122');
INSERT INTO `oil_analysis` VALUES ('30', '100', '2', '10020172', '一号破碎站', '一号破碎站板式给料机右侧电动机后端轴承', '1508428800', '0', '10209348', '7.10', '7.60', '7.30', '7.10', '7.65', '12.30', '17.00', 'Fe元素超标<br>Cu元素超标<br>PQ值超标<br>粘度偏高', '0', '1508485163', '1508485163');

-- ----------------------------
-- Table structure for oil_config
-- ----------------------------
DROP TABLE IF EXISTS `oil_config`;
CREATE TABLE `oil_config` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `postpone` int(10) DEFAULT '0',
  `update_time` int(11) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oil_config
-- ----------------------------
INSERT INTO `oil_config` VALUES ('1', '500', '1508224636', null);

-- ----------------------------
-- Table structure for oil_detail
-- ----------------------------
DROP TABLE IF EXISTS `oil_detail`;
CREATE TABLE `oil_detail` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `oil_no` int(11) DEFAULT NULL COMMENT '物料编码',
  `oil_name` varchar(150) DEFAULT NULL COMMENT '润滑油名称',
  `detail` varchar(255) DEFAULT NULL COMMENT '物料描述',
  `unit` varchar(10) DEFAULT NULL COMMENT '单位',
  `price` float(10,2) DEFAULT NULL COMMENT '价格',
  `Fe` float(10,2) DEFAULT NULL,
  `Cu` float(10,2) DEFAULT NULL,
  `Al` float(10,2) DEFAULT NULL,
  `Si` float(10,2) DEFAULT NULL,
  `Na` float(10,2) DEFAULT NULL,
  `PQ` float(10,2) DEFAULT NULL,
  `viscosity_max` float(10,2) DEFAULT NULL,
  `viscosity_min` float(10,2) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `oil_detail_id_uindex` (`id`),
  UNIQUE KEY `oil_detail_oil_no_uindex` (`oil_no`)
) ENGINE=MyISAM AUTO_INCREMENT=21 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oil_detail
-- ----------------------------
INSERT INTO `oil_detail` VALUES ('1', '10209358', '抗磨液压油', 'DTE 25;VG46;1×208L\\美孚', 'L', '20.56', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('3', '10209351', '抗磨液压油', 'DTE 10 超凡 32;VG32;1×208L\\美孚', 'L', '21.70', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('4', '10209286', '超级齿轮油', '600 XP 220;VG220;1×208L\\美孚', 'L', '17.01', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('5', '10209288', '超级齿轮油', '600 XP 320;VG320;1×208L\\美孚', 'L', '18.61', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('6', '10209289', '超级齿轮油', '600 XP 460;VG460;1×208L\\美孚', 'L', '18.77', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('7', '11102440', '液力传动油', '6#;1×170kg;200L\\昆仑', 'L', '12.60', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('8', '10209398', '传动油', '424;1×208L\\美孚', 'L', '24.30', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('9', '10209313', '合成齿轮油', 'SHC 626;VG68;1×208L\\美孚', 'L', '98.03', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('10', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '98.89', '2.31', '5.68', '7.56', '10.20', '13.00', '1.26', '16.00', '11.00', '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('11', '11249919', '极压锂基润滑脂', '尚博 0#;1×17kg\\长城', 'KG', '14.03', null, null, null, null, null, null, null, null, '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('12', '10061964', '极压锂基润滑脂', '尚博 3#;1×17kg\\长城', 'KG', '13.98', null, null, null, null, null, null, null, null, '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('13', '11249923', '通用锂基脂', '尚博 0#;1×17kg\\长城', 'KG', '12.95', null, null, null, null, null, null, null, null, '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('14', '11249924', '通用锂基脂', '尚博 1#;1×17kg\\长城', 'KG', '12.95', null, null, null, null, null, null, null, null, '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('15', '10889994', '通用锂基脂', '尚博 2#;1×17kg\\长城', 'KG', '12.95', null, null, null, null, null, null, null, null, '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('16', '10889996', '通用锂基脂', '尚博 3#;1×17kg\\长城', 'KG', '13.64', null, null, null, null, null, null, null, null, '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('17', '11249907', '二硫化钼锂基润滑脂', '尚博 0#;1×17KG\\长城', 'KG', '15.25', null, null, null, null, null, null, null, null, '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('18', '10705085', '二硫化钼锂基润滑脂', '尚博 2#;1×17KG\\长城', 'KG', '15.11', null, null, null, null, null, null, null, null, '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('19', '11249914', '高温高速润滑脂', 'HTHS 2#;1×17kg\\长城', 'KG', '34.53', null, null, null, null, null, null, null, null, '1508405676', '1508405676');
INSERT INTO `oil_detail` VALUES ('20', '10209438', '复合锂基润滑脂', '力富 SHC 100;NLGI 2;1×16kg\\美孚', 'KG', '121.50', null, null, null, null, null, null, null, null, '1508405676', '1508405676');

-- ----------------------------
-- Table structure for oil_no_list
-- ----------------------------
DROP TABLE IF EXISTS `oil_no_list`;
CREATE TABLE `oil_no_list` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `equ_no` int(11) DEFAULT NULL,
  `equ_key_no` int(11) DEFAULT NULL,
  `oil_no` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=626 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oil_no_list
-- ----------------------------
INSERT INTO `oil_no_list` VALUES ('529', '100', '100201717', '10209288');
INSERT INTO `oil_no_list` VALUES ('530', '200', '20020171', '11249923');
INSERT INTO `oil_no_list` VALUES ('531', '200', '20020171', '11249924');
INSERT INTO `oil_no_list` VALUES ('532', '200', '20020171', '10889994');
INSERT INTO `oil_no_list` VALUES ('533', '200', '20020171', '10889996');
INSERT INTO `oil_no_list` VALUES ('534', '200', '20020172', '10209358');
INSERT INTO `oil_no_list` VALUES ('535', '200', '20020172', '10209348');
INSERT INTO `oil_no_list` VALUES ('536', '200', '20020172', '10209351');
INSERT INTO `oil_no_list` VALUES ('537', '200', '20020173', '11249923');
INSERT INTO `oil_no_list` VALUES ('538', '200', '20020173', '11249924');
INSERT INTO `oil_no_list` VALUES ('539', '200', '20020173', '10889994');
INSERT INTO `oil_no_list` VALUES ('540', '200', '20020173', '10889996');
INSERT INTO `oil_no_list` VALUES ('541', '200', '20020174', '10061964');
INSERT INTO `oil_no_list` VALUES ('542', '200', '20020174', '11249919');
INSERT INTO `oil_no_list` VALUES ('543', '200', '20020175', '11249907');
INSERT INTO `oil_no_list` VALUES ('544', '200', '20020175', '10705085');
INSERT INTO `oil_no_list` VALUES ('545', '200', '20020176', '11249907');
INSERT INTO `oil_no_list` VALUES ('546', '200', '20020176', '10705085');
INSERT INTO `oil_no_list` VALUES ('547', '200', '20020177', '11249919');
INSERT INTO `oil_no_list` VALUES ('548', '200', '20020177', '10061964');
INSERT INTO `oil_no_list` VALUES ('549', '200', '20020178', '10209315');
INSERT INTO `oil_no_list` VALUES ('550', '200', '20020179', '10209313');
INSERT INTO `oil_no_list` VALUES ('551', '200', '200201710', '10209315');
INSERT INTO `oil_no_list` VALUES ('552', '200', '200201711', '11249919');
INSERT INTO `oil_no_list` VALUES ('553', '200', '200201712', '10209315');
INSERT INTO `oil_no_list` VALUES ('554', '200', '200201713', '10209315');
INSERT INTO `oil_no_list` VALUES ('555', '200', '200201714', '10209288');
INSERT INTO `oil_no_list` VALUES ('556', '200', '200201715', '10209315');
INSERT INTO `oil_no_list` VALUES ('557', '200', '200201716', '10209313');
INSERT INTO `oil_no_list` VALUES ('558', '200', '200201716', '10209315');
INSERT INTO `oil_no_list` VALUES ('559', '200', '200201716', '10209288');
INSERT INTO `oil_no_list` VALUES ('560', '200', '200201716', '10209289');
INSERT INTO `oil_no_list` VALUES ('561', '200', '200201717', '10209288');
INSERT INTO `oil_no_list` VALUES ('594', '100', '10020171', '11249923');
INSERT INTO `oil_no_list` VALUES ('595', '100', '10020171', '11249924');
INSERT INTO `oil_no_list` VALUES ('596', '100', '10020171', '10889994');
INSERT INTO `oil_no_list` VALUES ('597', '100', '10020171', '10889996');
INSERT INTO `oil_no_list` VALUES ('598', '100', '10020172', '10209358');
INSERT INTO `oil_no_list` VALUES ('599', '100', '10020172', '10209348');
INSERT INTO `oil_no_list` VALUES ('600', '100', '10020172', '10209351');
INSERT INTO `oil_no_list` VALUES ('601', '100', '10020172', '10889996');
INSERT INTO `oil_no_list` VALUES ('602', '100', '10020173', '11249923');
INSERT INTO `oil_no_list` VALUES ('603', '100', '10020173', '11249924');
INSERT INTO `oil_no_list` VALUES ('604', '100', '10020173', '10889994');
INSERT INTO `oil_no_list` VALUES ('605', '100', '10020173', '10889996');
INSERT INTO `oil_no_list` VALUES ('606', '100', '10020174', '10061964');
INSERT INTO `oil_no_list` VALUES ('607', '100', '10020174', '11249919');
INSERT INTO `oil_no_list` VALUES ('608', '100', '10020175', '11249907');
INSERT INTO `oil_no_list` VALUES ('609', '100', '10020175', '10705085');
INSERT INTO `oil_no_list` VALUES ('610', '100', '10020176', '11249907');
INSERT INTO `oil_no_list` VALUES ('611', '100', '10020176', '10705085');
INSERT INTO `oil_no_list` VALUES ('612', '100', '10020177', '11249919');
INSERT INTO `oil_no_list` VALUES ('613', '100', '10020177', '10061964');
INSERT INTO `oil_no_list` VALUES ('614', '100', '10020178', '10209315');
INSERT INTO `oil_no_list` VALUES ('615', '100', '10020179', '10209313');
INSERT INTO `oil_no_list` VALUES ('616', '100', '100201710', '10209315');
INSERT INTO `oil_no_list` VALUES ('617', '100', '100201711', '11249919');
INSERT INTO `oil_no_list` VALUES ('618', '100', '100201712', '10209315');
INSERT INTO `oil_no_list` VALUES ('619', '100', '100201713', '10209315');
INSERT INTO `oil_no_list` VALUES ('620', '100', '100201714', '10209288');
INSERT INTO `oil_no_list` VALUES ('621', '100', '100201715', '10209315');
INSERT INTO `oil_no_list` VALUES ('622', '100', '100201716', '11111111');
INSERT INTO `oil_no_list` VALUES ('623', '100', '100201716', '10209315');
INSERT INTO `oil_no_list` VALUES ('624', '100', '100201716', '10209288');
INSERT INTO `oil_no_list` VALUES ('625', '100', '100201716', '10209289');

-- ----------------------------
-- Table structure for oil_standard
-- ----------------------------
DROP TABLE IF EXISTS `oil_standard`;
CREATE TABLE `oil_standard` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `equ_no` int(11) NOT NULL DEFAULT '0' COMMENT '设备编号',
  `equ_oil_no` int(11) NOT NULL DEFAULT '0' COMMENT '润滑点编号',
  `equ_key_no` int(10) DEFAULT NULL,
  `equ_name` varchar(255) DEFAULT '' COMMENT '设备名称',
  `equ_oil_name` varchar(100) NOT NULL DEFAULT '' COMMENT '润滑点全称',
  `oil_no` int(10) DEFAULT NULL,
  `quantity` int(10) NOT NULL DEFAULT '0' COMMENT '用量',
  `first_period` int(10) NOT NULL DEFAULT '0' COMMENT '首保周期',
  `period` int(10) NOT NULL DEFAULT '0' COMMENT '更换最长周期',
  `interval` int(10) NOT NULL DEFAULT '0' COMMENT '油脂采样间隔',
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `oil_standard_id_uindex` (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=38 DEFAULT CHARSET=utf8 COMMENT='润滑标准样表';

-- ----------------------------
-- Records of oil_standard
-- ----------------------------
INSERT INTO `oil_standard` VALUES ('36', '100', '17', '100201717', '一号破碎站', '一号破碎站破碎机机集中润滑泵', '10209288', '100', '0', '3500', '500', '1508488659', '1508490357');
INSERT INTO `oil_standard` VALUES ('2', '100', '2', '10020172', '一号破碎站', '一号破碎站板式给料机右侧电动机后端轴承', '10209358', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('3', '100', '3', '10020173', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '11249923', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('4', '100', '4', '10020174', '一号破碎站', '一号破碎站板式给料机右侧电动后端轴承', '10061964', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('5', '100', '5', '10020175', '一号破碎站', '一号破碎站板式给料机左侧减速机', '10705085', '100', '500', '3500', '500', '1508400465', '1508490757');
INSERT INTO `oil_standard` VALUES ('6', '100', '6', '10020176', '一号破碎站', '一号破碎站板式给料机右侧减速机', '11249907', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('7', '100', '7', '10020177', '一号破碎站', '一号破碎站板式给料机低速联轴器', '11249919', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('8', '100', '8', '10020178', '一号破碎站', '一号破碎站板式给料机头轮左侧轴承', '10209315', '100', '0', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('9', '100', '9', '10020179', '一号破碎站', '一号破碎站板式给料机头轮左侧轴承', '10209313', '100', '0', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('10', '100', '10', '100201710', '一号破碎站', '一号破碎站板式给料机尾轮左侧轴承', '10209315', '100', '0', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('11', '100', '11', '100201711', '一号破碎站', '一号破碎站板式给料机尾轮右侧轴承', '11249919', '100', '0', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('12', '100', '12', '100201712', '一号破碎站', '一号破碎站板式给料机集中润滑泵', '10209315', '100', '0', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('13', '100', '13', '100201713', '一号破碎站', '一号破碎站破碎机电机', '10209315', '100', '0', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('14', '100', '14', '100201714', '一号破碎站', '一号破碎站破碎机偶合器', '10209288', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('15', '100', '15', '100201715', '一号破碎站', '一号破碎站破碎机减速机', '10209315', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('16', '100', '16', '100201716', '一号破碎站', '一号破碎站破碎机同步齿轮箱', '11111111', '100', '500', '3500', '500', '1508400465', '1508491204');
INSERT INTO `oil_standard` VALUES ('35', '100', '1', '10020171', '一号破碎站', '一号破碎站板式给料机左侧电动机前端轴承', '10889996', '100', '500', '3500', '500', '1508488659', '1508490761');
INSERT INTO `oil_standard` VALUES ('18', '200', '1', '20020171', '二号破碎站', '二号破碎站板式给料机左侧电动机前端轴承', '11249923', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('19', '200', '2', '20020172', '二号破碎站', '二号破碎站板式给料机右侧电动机后端轴承', '10209358', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('20', '200', '3', '20020173', '二号破碎站', '二号破碎站板式给料机左侧电动机前端轴承', '11249923', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('21', '200', '4', '20020174', '二号破碎站', '二号破碎站板式给料机右侧电动后端轴承', '10061964', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('22', '200', '5', '20020175', '二号破碎站', '二号破碎站板式给料机左侧减速机', '11249907', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('23', '200', '6', '20020176', '二号破碎站', '二号破碎站板式给料机右侧减速机', '11249907', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('24', '200', '7', '20020177', '二号破碎站', '二号破碎站板式给料机低速联轴器', '11249919', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('25', '200', '8', '20020178', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '10209315', '100', '0', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('26', '200', '9', '20020179', '二号破碎站', '二号破碎站板式给料机头轮左侧轴承', '10209313', '100', '0', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('27', '200', '10', '200201710', '二号破碎站', '二号破碎站板式给料机尾轮左侧轴承', '10209315', '100', '0', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('28', '200', '11', '200201711', '二号破碎站', '二号破碎站板式给料机尾轮右侧轴承', '11249919', '100', '0', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('29', '200', '12', '200201712', '二号破碎站', '二号破碎站板式给料机集中润滑泵', '10209315', '100', '0', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('30', '200', '13', '200201713', '二号破碎站', '二号破碎站破碎机电机', '10209315', '100', '0', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('31', '200', '14', '200201714', '二号破碎站', '二号破碎站破碎机偶合器', '10209288', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('32', '200', '15', '200201715', '二号破碎站', '二号破碎站破碎机减速机', '10209315', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('33', '200', '16', '200201716', '二号破碎站', '二号破碎站破碎机同步齿轮箱', '10209313', '100', '500', '3500', '500', '1508400465', '1508490357');
INSERT INTO `oil_standard` VALUES ('34', '200', '17', '200201717', '二号破碎站', '二号破碎站破碎机机集中润滑泵', '10209288', '100', '0', '3500', '500', '1508400465', '1508490357');

-- ----------------------------
-- Table structure for oil_used
-- ----------------------------
DROP TABLE IF EXISTS `oil_used`;
CREATE TABLE `oil_used` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `equ_key_no` int(11) DEFAULT NULL,
  `del_warning_time` int(11) DEFAULT NULL,
  `oil_no` int(11) DEFAULT NULL,
  `oil_name` varchar(50) DEFAULT NULL,
  `detail` varchar(200) DEFAULT NULL,
  `unit` varchar(5) DEFAULT NULL,
  `quantity` int(11) DEFAULT NULL,
  `price` float(10,2) DEFAULT NULL,
  `cost` float(10,2) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=70 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oil_used
-- ----------------------------
INSERT INTO `oil_used` VALUES ('36', '10020174', '1483372800', '11249919', '极压锂基润滑脂', '尚博 0#;1×17kg\\长城', 'KG', '100', '14.03', '1403.00', '1508462624', '1508462624');
INSERT INTO `oil_used` VALUES ('37', '10020175', '1483372800', '11249919', '极压锂基润滑脂', '尚博 0#;1×17kg\\长城', 'KG', '100', '14.03', '1403.00', '1508462624', '1508462624');
INSERT INTO `oil_used` VALUES ('38', '10020176', '1483372800', '11249907', '二硫化钼锂基润滑脂', '尚博 0#;1×17KG\\长城', 'KG', '100', '15.25', '1525.00', '1508462624', '1508462624');
INSERT INTO `oil_used` VALUES ('39', '10020177', '1483372800', '10061964', '极压锂基润滑脂', '尚博 3#;1×17kg\\长城', 'KG', '100', '13.98', '1398.00', '1508462624', '1508462624');
INSERT INTO `oil_used` VALUES ('40', '10020178', '1483372800', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889.00', '1508462624', '1508462624');
INSERT INTO `oil_used` VALUES ('41', '10020179', '1483372800', '10209313', '合成齿轮油', 'SHC 626;VG68;1×208L\\美孚', 'L', '100', '98.03', '9803.00', '1508462624', '1508462624');
INSERT INTO `oil_used` VALUES ('42', '100201710', '1483372800', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889.00', '1508462624', '1508462624');
INSERT INTO `oil_used` VALUES ('43', '100201711', '1483372800', '11249919', '极压锂基润滑脂', '尚博 0#;1×17kg\\长城', 'KG', '100', '14.03', '1403.00', '1508462624', '1508462624');
INSERT INTO `oil_used` VALUES ('44', '100201712', '1483372800', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889.00', '1508462624', '1508462624');
INSERT INTO `oil_used` VALUES ('45', '100201713', '1483372800', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889.00', '1508462624', '1508462624');
INSERT INTO `oil_used` VALUES ('46', '100201714', '1483372800', '10209288', '超级齿轮油', '600 XP 320;VG320;1×208L\\美孚', 'L', '100', '18.61', '1861.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('47', '100201715', '1483372800', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('48', '100201716', '1483372800', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('50', '20020171', '1483372800', '11249923', '通用锂基脂', '尚博 0#;1×17kg\\长城', 'KG', '100', '12.95', '1295.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('52', '20020173', '1483372800', '10889994', '通用锂基脂', '尚博 2#;1×17kg\\长城', 'KG', '100', '12.95', '1295.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('53', '20020174', '1483372800', '11249919', '极压锂基润滑脂', '尚博 0#;1×17kg\\长城', 'KG', '100', '14.03', '1403.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('54', '20020175', '1483372800', '11249919', '极压锂基润滑脂', '尚博 0#;1×17kg\\长城', 'KG', '100', '14.03', '1403.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('55', '20020176', '1483372800', '11249907', '二硫化钼锂基润滑脂', '尚博 0#;1×17KG\\长城', 'KG', '100', '15.25', '1525.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('56', '20020177', '1483372800', '10061964', '极压锂基润滑脂', '尚博 3#;1×17kg\\长城', 'KG', '100', '13.98', '1398.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('57', '20020178', '1483372800', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('58', '20020179', '1483372800', '10209313', '合成齿轮油', 'SHC 626;VG68;1×208L\\美孚', 'L', '100', '98.03', '9803.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('59', '200201710', '1483372800', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('60', '200201711', '1483372800', '11249919', '极压锂基润滑脂', '尚博 0#;1×17kg\\长城', 'KG', '100', '14.03', '1403.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('61', '200201712', '1483372800', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('62', '200201713', '1483372800', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('63', '200201714', '1483372800', '10209288', '超级齿轮油', '600 XP 320;VG320;1×208L\\美孚', 'L', '100', '18.61', '1861.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('64', '200201715', '1483372800', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('65', '200201716', '1483372800', '10209315', '合成齿轮油', 'SHC 629;VG150;1×208L\\美孚', 'L', '100', '98.89', '9889.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('66', '200201717', '1483372800', '10209288', '超级齿轮油', '600 XP 320;VG320;1×208L\\美孚', 'L', '100', '18.61', '1861.00', '1508462625', '1508462625');
INSERT INTO `oil_used` VALUES ('68', '10020175', '1508515199', '10705085', '二硫化钼锂基润滑脂', '尚博 2#;1×17KG\\长城', 'KG', '100', '15.11', '1511.00', '1508471926', '1508471926');
INSERT INTO `oil_used` VALUES ('69', '10020177', '1508515199', '10705085', '二硫化钼锂基润滑脂', '尚博 2#;1×17KG\\长城', 'KG', '100', '15.11', '1511.00', '1508471930', '1508471930');

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `account` varchar(30) NOT NULL,
  `password` char(32) NOT NULL,
  `scope` tinyint(2) DEFAULT NULL COMMENT '权限 1：超级管理员 2：系统维护员 3：普通工作人员',
  `name` varchar(10) DEFAULT NULL,
  `phone` char(11) DEFAULT NULL,
  `update_time` int(11) DEFAULT NULL,
  `create_time` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `user_account_uindex` (`account`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('1', 'admin', 'e10adc3949ba59abbe56e057f20f883e', '36', 'admin', '15148936547', '1508227946', null);
INSERT INTO `user` VALUES ('4', 'runhua1', 'e10adc3949ba59abbe56e057f20f883e', '18', '王宝强', '', '1508311122', '1506419665');
INSERT INTO `user` VALUES ('5', 'runhua2', 'e10adc3949ba59abbe56e057f20f883e', '9', '宋伟', '', '1506419689', '1506419689');
INSERT INTO `user` VALUES ('6', 'runhua3', '4297f44b13955235245b2497399d7a93', '9', '黄晓明', '15641369632', '1508393507', '1508393507');

-- ----------------------------
-- Table structure for work_hour
-- ----------------------------
DROP TABLE IF EXISTS `work_hour`;
CREATE TABLE `work_hour` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `equ_no` int(11) NOT NULL COMMENT '设备编号',
  `equ_name` varchar(100) DEFAULT NULL COMMENT '润滑点名称',
  `working_hour` int(100) NOT NULL,
  `start_time` int(100) DEFAULT NULL,
  `create_time` int(100) DEFAULT NULL,
  `update_time` int(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of work_hour
-- ----------------------------
INSERT INTO `work_hour` VALUES ('1', '100', '一号破碎站', '360', '1483200000', '1508400529', '1508492044');
INSERT INTO `work_hour` VALUES ('2', '200', '二号破碎站', '360', '1483200000', '1508400529', '1508492044');
INSERT INTO `work_hour` VALUES ('3', '100', '一号破碎站', '360', '1485878400', '1508400529', '1508492044');
INSERT INTO `work_hour` VALUES ('4', '200', '二号破碎站', '360', '1485878400', '1508400529', '1508492044');
